require: slotfilling/slotFilling.sc
  module = sys.zb-common
  
require: Logic/functions.js
require: Logic/funcGPT.js
require: Logic/yandexGPT.js
require: Logic/companies.js
require: dateTime/dateTime.sc
  module = sys.zb-common
theme: /


    state: Start, sessionResultColor = "#BC3737"
        q!: $regex</start> [$regex<\{.*\}>]
        script:
            if ($parseTree.text.length > "/start".length) {
                $session.startData = JSON.parse($parseTree.text.substr("/start".length + 1));
            }
        if: ($session.startData && $session.startData.name.length > 0)
            script:
                $session.ФИО = $session.startData.surname + " " + $session.startData.name + " " + $session.startData.patname
            a: {{hello()}}, {{$session.startData.name}}  {{$session.startData.patname}}!
        else:
            a: {{hello()}}!
        go!: /Вот что я умею

    state: Hello
        intent!: /hello
        a: {{hello()}}. || htmlEnabled = true, html = "{{hello()}}."
        go!: /Вот что я умею

    state: Bye || sessionResult = "Окончание", sessionResultColor = "#BC3737"
        intent!: /bye
        go!: /Bye/Начало
        state: Начало
            if: $session.startData
                random: 
                    a: До свидания, {{$session.startData.name}} {{$session.startData.patname}}! || htmlEnabled = true, html = "До свидания, {{$session.startData.name}} {{$session.startData.patname}}!"
                    a: Всего хорошего, {{$session.startData.name}} {{$session.startData.patname}}! || htmlEnabled = true, html = "Всего хорошего, {{$session.startData.name}} {{$session.startData.patname}}!"
                    a: Всего наилучшего, {{$session.startData.name}} {{$session.startData.patname}}! || htmlEnabled = true, html = "Всего наилучшего, {{$session.startData.name}} {{$session.startData.patname}}!"
            else: 
                random: 
                    a: До свидания! || htmlEnabled = true, html = "До свидания!"
                    a: Всего хорошего! || htmlEnabled = true, html = "Всего хорошего!"
                    a: Всего наилучшего! || htmlEnabled = true, html = "Всего наилучшего!"

    state: NoMatch || sessionResult = "Фраза не распознана", sessionResultColor = "#FFFFFF"
        event!: noMatch
        go!: /NoMatch/Начало
        state: Начало
            script:
                //{{$request.query}}
            random: 
                a: К сожалению, у меня пока нет информации, которая помогла бы ответить на ваш вопрос. Но я буду стараться и учиться, чтобы всегда быть к вашим услугам. || htmlEnabled = true, html = "К сожалению, у меня пока нет информации, которая помогла бы ответить на ваш вопрос. Но я буду стараться и учиться, чтобы всегда быть к вашим услугам."
                a: Извините, я пока не знаю ответа на ваш вопрос. Но я очень любознательный и всегда готов анализировать запросы, которые попадаются мне впервые. Научимся вместе! || htmlEnabled = true, html = "Извините, я пока не знаю ответа на ваш вопрос. Но я очень любознательный и всегда готов анализировать запросы, которые попадаются мне впервые. Научимся вместе!"
                a: Похоже, я в этой ситуации как на вечеринке, где я только что заметил новый стиль танцев, но еще не успел выучить его. Но я быстро подхвачу ритм и буду готов к следующей танцевальной волне! || htmlEnabled = true, html = "Похоже, я в этой ситуации как на вечеринке, где я только что заметил новый стиль танцев, но еще не успел выучить его. Но я быстро подхвачу ритм и буду готов к следующей танцевальной волне!"
                a: Ученые так и не разгадали тайну природы электричества, поэтому не огорчайтесь, что я пока не знаю ответа на ваш вопрос. Но я быстро учусь и постоянно обрабатываю неизвестные мне запросы, даже самые сложные. || htmlEnabled = true, html = "Ученые так и не разгадали тайну природы электричества, поэтому не огорчайтесь, что я пока не знаю ответа на ваш вопрос. Но я быстро учусь и постоянно обрабатываю неизвестные мне запросы, даже самые сложные."
                a: Как капитан корабля в шторм, я иногда оказываюсь перед неизведанными волнами вопросов. Но как исследователь, я готов плыть дальше и искать ответы вместе с вами! || htmlEnabled = true, html = "Как капитан корабля в шторм, я иногда оказываюсь перед неизведанными волнами вопросов. Но как исследователь, я готов плыть дальше и искать ответы вместе с вами!"
                a: Затерянный остров Атлантида, чёрные дыры, цивилизация Майя, исчезновение динозавров - в этом мире еще столько неизведанных тайн, поэтому мне не стыдно признаться, что я пока не знаю ответа на Ваш вопрос. Но скоро я исправлюсь. 
                        PS: про исчезновение Атлантиды рассказать не обещаю || htmlEnabled = true, html = "Затерянный остров Атлантида, чёрные дыры, цивилизация Майя, исчезновение динозавров - в этом мире еще столько неизведанных тайн, поэтому мне не стыдно признаться, что я пока не знаю ответа на Ваш вопрос. Но скоро я исправлюсь.&nbsp;<br>PS: про исчезновение Атлантиды рассказать не обещаю"
                a: Ой, этот вопрос действительно интересный! Но, к сожалению, даже ТеМКа иногда сталкивается с трудностями. Я изучу его и в скором времени смогу поразить вас своим блестящим ответом. || htmlEnabled = true, html = "Ой, этот вопрос действительно интересный! Но, к сожалению, даже ТеМКа иногда сталкивается с трудностями. Я изучу его и в скором времени смогу поразить вас своим блестящим ответом."
                a: Как детектив, я иногда оказываюсь перед загадкой, которую даже Шерлок Холмс бы не разгадал. Но не волнуйтесь, мы можем начать собирать улики! || htmlEnabled = true, html = "Как детектив, я иногда оказываюсь перед загадкой, которую даже Шерлок Холмс бы не разгадал. Но не волнуйтесь, мы можем начать собирать улики!"
            go!: /Вот что я умею

    state: Match
        event!: match
        a: {{$context.intent.answer}}
             || htmlEnabled = true, html = "{{$context.intent.answer}}<br>"
        go!: /Вот что я умею

    state: Вот что я умею
        intent!: /Вот что я умею
        go!: /Вот что я умею/Начало

        #Test
        state: HelpDesk || sessionResult = "HelpDesk", sessionResultColor = "#FFFFFF"
            intent!: /Услуга/HelpDesk
            a: Сервис в разработке!!!
                На данный момент мы прорабатываем 4 сервиса. || htmlEnabled = true, html = "<b>Сервис в разработке!!!</b><br>На данный момент мы прорабатываем 4 сервиса.<br><br>"
            a: - Консультация по работе с АРМ. 
                - Профилактика и техническое обслуживание ПК.
                - Работа с данными 1С.
                - Корпоративный портал || htmlEnabled = true, html = "- Консультация по работе с АРМ.&nbsp;<br>- Профилактика и техническое обслуживание ПК.<br>- Работа с данными 1С.<br>- Корпоративный портал"
            a: Какая услуга вам нужна?
            buttons:
                "Корпоративный портал" -> /Корпоративный портал
                "Работа с данными 1С" -> /Работа с данными 1С
                "Обслуживание ПК" -> /Профилактика и техническое обслуживание ПК
                "По работе с АРМ" -> /Консультация по работе с АРМ
                "Назад"
            intent: /Услуга/Консультация по работе с АРМ || toState = "/Консультация по работе с АРМ"
            intent: /Услуга/Корпоративный портал || toState = "/Корпоративный портал"
            intent: /Услуга/Профилактика и техническое обслуживание ПК || toState = "/Профилактика и техническое обслуживание ПК"
            intent: /Услуга/Работа с данными 1С || toState = "/Работа с данными 1С"
            event: noMatch || toState = "/Услуги/Я не понял"
        

        state: Начало
            script: $session.wasDataProcessingAgreement = false;
            random: 
                a: Вот некоторые из моих возможностей: || htmlEnabled = true, html = "Вот некоторые из моих возможностей:"
                a: Вот список моих ключевых функций: || htmlEnabled = true, html = "Вот список моих ключевых функций:"
                a: Вот некоторые из моих главных умений: || htmlEnabled = true, html = "Вот некоторые из моих главных умений:"
                a: Вот что я умею: || htmlEnabled = true, html = "Вот что я умею:"
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city =="Москва"
                    buttons:
                        "Кафе" -> /Кафе
            buttons:
                "Комплаенс/этика/закон" -> /Комплаенс этика и закон
                "Обратная связь/Добавить в чат-бот" -> /Обратная связь
                "Сервисы для сотрудников" -> /Вот что я умею/Сервисы для сотрудников
                "Информация о чат-боте" -> /Информация о чат-боте
                "Сказки GPT" -> /Сказки GPT
                "Полезная информация" -> /Вот что я умею/Полезная информация
                "Социальная поддержка" -> /Комплаенс этика и закон/Социальная поддержка
               
                
        state: Сервисы для сотрудников
            a: Хороший выбор! || htmlEnabled = true, html = "Хороший выбор!"
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city =="Москва"
                    buttons:
                        "Заявка в службу эксплуатации" -> /Заявка в службу эксплуатации
            buttons:
                "Заявка на самовыдвижение" -> /Заявка на самовыдвижение
                "Биржа идей" -> /Биржа идей
                "Поиск сотрудников" -> /Поиск сотрудника
                "Личный профиль на портале" -> /Личный профиль на портале
                "Назад" -> /Вот что я умею/Начало
                

        state: Полезная информация
            a: У меня много полезной информации! || htmlEnabled = true, html = "У меня много полезной информации!"
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city =="Москва"
                    buttons:
                        "Заказ корпоративного транспорта" -> /Заказ корпоративного транспорта
                        "Заказ гостевого пропуска" -> /Заказ гостевого пропуска
                        "Электронные ключницы" -> /Электронные ключницы
            buttons:
                "Расчетный лист" -> /Расчетных листов
                "Дни рождения" -> /Дни рождения
                "Курсы валют" -> /Курс валют
                "Назад" -> /Вот что я умею/Начало

    state: Комплаенс этика и закон
        intent!: /Закон
        go!: /Комплаенс этика и закон/Начало

        state: Полис ОМС || sessionResult = "Полис ОМС", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Медицина/Полис ОМС
            a: Впервые получить полис ОМС можно:
                О онлайн через Госуслуги (подсветить ссылкой https://www.gosuslugi.ru/600770/1/form). 
                Через страховую компанию в своём регионе (подсветить ссылкой https://www.ffoms.gov.ru/documents/registry/CMO/ )
                Лично через МФЦ.
                 Уточните заранее, оказывает ли выбранный МФЦ такую услугу Полис ОМС могут оформить работающие в России граждане стран ЕАЭС. || htmlEnabled = true, html = "Впервые получить полис ОМС можно:<br><ul><li>О онлайн через Госуслуги (подсветить ссылкой <a href="https://www.gosuslugi.ru/600770/1/form" target="_blank">https://www.gosuslugi.ru/600770/1/form</a>).&nbsp;</li><li>Через страховую компанию в своём регионе (подсветить ссылкой&nbsp;<a href="https://www.ffoms.gov.ru/documents/registry/CMO/" target="_blank">https://www.ffoms.gov.ru/documents/registry/CMO/</a> )</li><li>Лично через МФЦ.</li><li><br></li><li><span style="letter-spacing: 0px;">&nbsp;Уточните заранее, оказывает ли выбранный МФЦ такую услугу Полис ОМС могут оформить работающие в России граждане стран ЕАЭС.</span><br></li></ul>"
            a: Будет действовать до конца календарного года, но не более срока действия трудового договора. Порядок получения — такой же, как и для граждан РФБеженцы, иностранцы и люди без гражданства также получают полис ОМС, действующий до конца календарного года. || htmlEnabled = true, html = "Будет действовать до конца календарного года, но не более срока действия трудового договора. Порядок получения — такой же, как и для граждан РФБеженцы, иностранцы и люди без гражданства также получают полис ОМС, действующий до конца календарного года."
            a: Действие полиса в таких случаях может завершиться раньше — если закончился срок действия документа о праве пребывания в России. С более подробной информацией Вы можете ознакомиться по ссылке: (gosuslugi.ru). || htmlEnabled = true, html = "Действие полиса в таких случаях может завершиться раньше — если закончился срок действия документа о праве пребывания в России. С более подробной информацией Вы можете ознакомиться по ссылке: (<a href="https://www.gosuslugi.ru/life/details/get_a_health_insurance_policy" target="_blank">gosuslugi.ru</a>)."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Медицина
                "На главную" -> /Вот что я умею

        state: Полис ДМС || sessionResult = "Полис ДМС", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Медицина/Полис ДМС
            a: Информацию о программах и условиях Добровольного медицинского страхования Вы можете получить, обратившись в Службу управления персоналом своей организации. || htmlEnabled = true, html = "Информацию о программах и условиях Добровольного медицинского страхования Вы можете получить, обратившись в Службу управления персоналом своей организации."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Медицина
                "На главную" -> /Вот что я умею

        state: Игры мастеров || sessionResult = "Игры мастеров", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Обучение/Развивающие проекты/Игры мастеров
            a: Чемпионат профессионального мастерства Игры мастеров - это уникальный развивающий проект ТМК и Группы Синара, который организует Корпоративный университет ТМК2U с 2018 года. Основная цель чемпионата – обеспечение высокого уровня развития технических компетенций производственного персонала компании, повышение производительности труда, культуры производства и популяризация рабочих профессий.  || htmlEnabled = true, html = "Чемпионат профессионального мастерства Игры мастеров - это уникальный развивающий проект ТМК и Группы Синара, который организует Корпоративный университет ТМК2U с 2018 года. Основная цель чемпионата – обеспечение высокого уровня развития технических компетенций производственного персонала компании, повышение производительности труда, культуры производства и популяризация рабочих профессий.&nbsp;<br>"
            a: В течение нескольких дней участники соревнуются в своих компетенциях под наблюдением опытных экспертов, а еще обучаются на мастер-классах, участвуют в квестах и других командообразующих мероприятиях, общаются и перенимают полезный опыт. Для участия в чемпионате необходимо пройти профессиональный отбор на своем предприятии. || htmlEnabled = true, html = "В течение нескольких дней участники соревнуются в своих компетенциях под наблюдением опытных экспертов, а еще обучаются на мастер-классах, участвуют в квестах и других командообразующих мероприятиях, общаются и перенимают полезный опыт. Для участия в чемпионате необходимо пройти профессиональный отбор на своем предприятии."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Развивающие проекты
                "На главную" -> /Вот что я умею

        state: Периодический медицинский осмотр (профосмотр) || sessionResult = "Периодический медицинский осмотр", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Медицина/Периодический медицинский осмотр (профосмотр)
            a: Обязательные периодические медицинские осмотры (ПМО) проводятся в целях динамического наблюдения за состоянием здоровья работников, своевременного выявления начальных форм профессиональных заболеваний, ранних признаков воздействия вредных и (или) опасных производственных факторов рабочей среды, трудового процесса на состояние здоровья работников в целях формирования групп риска развития профессиональных заболеваний, выявления медицинских противопоказаний к осуществлению отдельных видов работ.  || htmlEnabled = true, html = "Обязательные периодические медицинские осмотры (ПМО) проводятся в целях динамического наблюдения за состоянием здоровья работников, своевременного выявления начальных форм профессиональных заболеваний, ранних признаков воздействия вредных и (или) опасных производственных факторов рабочей среды, трудового процесса на состояние здоровья работников в целях формирования групп риска развития профессиональных заболеваний, выявления медицинских противопоказаний к осуществлению отдельных видов работ.&nbsp;<br>"
            a: Частота проведения ПМО определяется типами вредных и (или) опасных производственных факторов, воздействующих на работника, или видами выполняемых работ. Оплачиваются работодателем. || htmlEnabled = true, html = "Частота проведения ПМО определяется типами вредных и (или) опасных производственных факторов, воздействующих на работника, или видами выполняемых работ. Оплачиваются работодателем.<br>"
            a: При проведении ПМО обследуемые лица проходят:
                
                Анкетирование.
                Определения факторов риска и других патологических состояний и заболеваний 
                Исследования || htmlEnabled = true, html = "При проведении ПМО обследуемые лица проходят:<br><ul><li>Анкетирование.</li><li>Определения факторов риска и других патологических состояний и заболеваний </li><li>Исследования</li></ul>"
            a: Исследования:
                
                Рост. 
                Вес.
                Окружность талии.
                Индекс массы тела. 
                Общий анализ крови.
                Клинический анализ мочи. 
                ЭКГ.
                Измерение АД. 
                Определение уровня общего холестерина в крови и Глюкозы. 
                Определение относительного сердечно-сосудистого риска у граждан в возрасте 18- 40 лет.
                Старше 40 лет - абсолютного сердечно-сосудистого риска по шкале SCORE.
                Флюорография или рентгенография легких.
                Измерение внутриглазного давления с 40 лет.
                Осмотр врача-терапевта.
                Врача-невролога.
                Врача-психиатра и врача-нарколога. || htmlEnabled = true, html = "Исследования:<br><ul><li>Рост.&nbsp;</li><li>Вес.</li><li>Окружность талии.</li><li>Индекс массы тела.&nbsp;</li><li>Общий анализ крови.</li><li>Клинический анализ мочи.&nbsp;</li><li>ЭКГ.</li><li>Измерение АД.&nbsp;</li><li>Определение уровня общего холестерина в крови и Глюкозы.&nbsp;</li><li>Определение относительного сердечно-сосудистого риска у граждан в возрасте 18- 40 лет.</li><li>Старше 40 лет - абсолютного сердечно-сосудистого риска по шкале SCORE.</li><li>Флюорография или рентгенография легких.</li><li>Измерение внутриглазного давления с 40 лет.</li><li>Осмотр врача-терапевта.</li><li>Врача-невролога.</li><li>Врача-психиатра и врача-нарколога.</li></ul>"
            a: Женщины:
                
                Осмотр врачом - акушером-гинекологом с проведением бактериологического (на флору) и цитологического (на атипичные клетки) исследования.
                УЗИ органов малого таза.
                Женщины старше 40 лет:
                
                Маммография.
                Иные исследования и осмотры врачей-специалистов согласно "вредности". || htmlEnabled = true, html = "Женщины:<br><ul><li>Осмотр врачом - акушером-гинекологом с проведением бактериологического (на флору) и цитологического (на атипичные клетки) исследования.</li><li>УЗИ органов малого таза.</li></ul>Женщины старше 40 лет:<br><ul><li>Маммография.</li><li>Иные исследования и осмотры врачей-специалистов согласно "вредности".</li></ul>"
            a: Узнать больше - Приказ Минздрава РФ от 28.01.2021 N 29Н  || htmlEnabled = true, html = "Узнать больше - <a href="http://www.consultant.ru/document/cons_doc_LAW_375353/?ysclid=l6us3wkbgj921225523" target="_blank">Приказ Минздрава РФ от 28.01.2021 N 29Н&nbsp;</a>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Медицина
                "На главную" -> /Вот что я умею

        state: Предварительный медицинский осмотр || sessionResult = "Предварительный медицинский осмотр", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Медицина/Предварительный медицинский осмотр
            a: Обязательные предварительные медицинские осмотры (ПМО) при поступлении на работу проводятся с целью определения соответствия состояния здоровья лица, поступающего на работу, поручаемой ему работе. Направление на ПМО выдает служба по управлению персоналом. До прохождения ПМО и получения заключения по его итогам трудоустройство не осуществляется.  || htmlEnabled = true, html = "Обязательные предварительные медицинские осмотры (ПМО) при поступлении на работу  проводятся с целью определения соответствия состояния здоровья лица, поступающего на работу, поручаемой ему работе. Направление на ПМО выдает служба по управлению персоналом. До прохождения ПМО и получения заключения по его итогам трудоустройство не осуществляется.&nbsp;"
            a: ПМО включает:
                
                Анкетирование.
                Определение факторов риска и других патологических состояний и заболеваний, повышающих вероятность развития хронических неинфекционных заболеваний. || htmlEnabled = true, html = "ПМО включает:<br><ul><li>Анкетирование.</li><li>Определение факторов риска и других патологических состояний и заболеваний, повышающих вероятность развития хронических неинфекционных заболеваний.</li></ul>"
            a: Также исследования:
                Антропометрия (рост, вес, окружность талии, индекс массы тела, общий анализ крови, клинический анализ мочи, ЭКГ, измерение АД, определение уровня общего холестерина в крови и глюкозы.
                Определение относительного сердечно-сосудистого риска у граждан 18- 40 лет.
                Определение сердечно-сосудистого риска по шкале SCORE, флюорография или рентгенография легких, измерение внутриглазного давления с 40 лет и старше. Женщины - осмотр врачом - акушером-гинекологом с проведением бактериологического (на флору) и цитологического (на атипичные клетки) исследования,УЗИ органов малого таза.
                Женщины старше 40 лет - маммография, иные исследования и осмотры врачей-специалистов проводятся в зависимости от вида работ. || htmlEnabled = true, html = "Также исследования: <br><ul><li>Антропометрия (рост, вес, окружность талии, индекс массы тела, общий анализ крови, клинический анализ мочи, ЭКГ, измерение АД, определение уровня общего холестерина в крови и глюкозы.</li><li>Определение относительного сердечно-сосудистого риска у граждан 18- 40 лет.</li><li>Определение сердечно-сосудистого риска по шкале SCORE, флюорография или рентгенография легких, измерение внутриглазного давления с 40 лет и старше. Женщины - осмотр врачом - акушером-гинекологом с проведением бактериологического (на флору) и цитологического (на атипичные клетки) исследования,УЗИ органов малого таза.</li><li>Женщины старше 40 лет - маммография, иные исследования и осмотры врачей-специалистов проводятся в зависимости от вида работ.</li></ul>"
            a: Узнать больше - Приказ Минздрава РФ от 28.01.2021 N 29Н  || htmlEnabled = true, html = "<a href="http://www.consultant.ru/document/cons_doc_LAW_375353/?ysclid=l6us3wkbgj921225523" target="_blank">Узнать больше - Приказ Минздрава РФ от 28.01.2021 N 29Н&nbsp;</a>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Медицина
                "На главную" -> /Вот что я умею

        state: Информация о медицине || sessionResult = "Информация о медицине", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Медицина/Информация о медицине
            a: Задать вопросы и получить информацию о социальной поддержке по направлению "Медицина" Вы можете, обратившись в Службу по управлению персоналом Вашей организации / предприятия. || htmlEnabled = true, html = "Задать вопросы и получить информацию о социальной поддержке по направлению "Медицина" Вы можете, обратившись в Службу по управлению  персоналом Вашей организации / предприятия."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Медицина
                "На главную" -> /Вот что я умею

        state: Медицина || sessionResult = "Медицина", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Медицина
            a: Конечно, о медицине нужно знать! || htmlEnabled = true, html = "Конечно, о медицине нужно знать!"
            buttons:
                "Информация о медицине" -> /Комплаенс этика и закон/Информация о медицине
                "Предварительный медицинский осмотр" -> /Комплаенс этика и закон/Предварительный медицинский осмотр
                "Периодический медицинский осмотр (профосмотр)" -> /Комплаенс этика и закон/Периодический медицинский осмотр (профосмотр)
                "Полис ОМС" -> /Комплаенс этика и закон/Полис ОМС
                "Полис ДМС" -> /Комплаенс этика и закон/Полис ДМС
                "Назад" -> /Комплаенс этика и закон/Социальная поддержка

        state: Развивающие проекты || sessionResult = "Развивающие проекты", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Обучение/Развивающие проекты
            a: Спасибо за интерес к развивающим проектам. || htmlEnabled = true, html = "Спасибо за интерес к развивающим проектам."
            buttons:
                "Горизонты" -> /Комплаенс этика и закон/Горизонты
                "Игры мастеров" -> /Комплаенс этика и закон/Игры мастеров
                "Open2U" -> /Комплаенс этика и закон/Open2U
                "Назад" -> /Комплаенс этика и закон/Обучение

        state: Open2U
            intent!: /Комплаенс этика и закон/Социальная поддержка/Обучение/Развивающие проекты/Open2U
            a: Сообщество на базе SOTA2U. Открытое пространство мнений и диалогов, где можно делиться своими знаниями. || htmlEnabled = true, html = "Сообщество на базе SOTA2U. Открытое пространство мнений и диалогов, где можно делиться своими знаниями."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Развивающие проекты
                "На главную" -> /Вот что я умею


        state: Горизонты || sessionResult = "Форум Горизонты", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Обучение/Развивающие проекты/Горизонты
            a: Форум «Горизонты» — международное общекорпоративное мероприятие Трубной металлургической компании и Группы Синара, которое ежегодно проводится в г. Сочи. В нем участвуют молодые работники, представляющие все дивизионы и ключевые направления деятельности компаний. Организатором форума выступает Корпоративный университет ТМК2U. Для участия в форуме необходимо пройти отборочный тур на своем предприятии. || htmlEnabled = true, html = "Форум «Горизонты» — международное общекорпоративное мероприятие Трубной металлургической компании и Группы Синара, которое ежегодно проводится в г. Сочи. В нем участвуют молодые работники, представляющие все дивизионы и ключевые направления деятельности компаний. Организатором форума выступает Корпоративный университет ТМК2U. Для участия в форуме необходимо пройти отборочный тур на своем предприятии."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Развивающие проекты
                "На главную" -> /Вот что я умею

        state: MOBI2U || sessionResult = "Mobi2U", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Обучение/Цифровые помощники/MOBI2U
            a: Корпоративная социальная сеть ТМК. Ссылка на информацию: https://intranet.chelpipegroup.com/services/mobi2u/welcome/default.html || htmlEnabled = true, html = "Корпоративная социальная сеть ТМК.\nСсылка на информацию: <a href="https://intranet.chelpipegroup.com/services/mobi2u/welcome/default.html" target="_blank">https://intranet.chelpipegroup.com/services/mobi2u/welcome/default.html</a>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Цифровые помощники
                "На главную" -> /Вот что я умею

        state: Корпоративная библиотека || sessionResult = "Корпоративная библиотека", sessionResultColor = "#FFFFFF"
            intent!: /Библиотека/TMK2U
            a: Изучить электронную библиотеку Корпоративного университета TMK2U Вы можете по ссылке. (ссылку подсветить и прикрепить https://tmk2u.alpinadigital.ru/ ) || htmlEnabled = true, html = "Изучить электронную библиотеку Корпоративного университета TMK2U Вы можете по ссылке. (ссылку подсветить и прикрепить <a href="https://tmk2u.alpinadigital.ru" target="_blank">https://tmk2u.alpinadigital.ru</a>/ )<br>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Цифровые помощники
                "На главную" -> /Вот что я умею

        state: SOTA2U || sessionResult = "Sota2U", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Обучение/Цифровые помощники/SOTA2U
            a: SOTA2U - образовательная платформа Корпоративного университета ТМК. Чтобы выбрать курс и пройти обучение, необходимо зарегистрироваться или авторизоваться на сайте https://sota2u.tmk-group.com/ или в мобильном приложении SOTA2U || htmlEnabled = true, html = "SOTA2U - образовательная платформа Корпоративного университета ТМК. Чтобы выбрать курс и пройти обучение, необходимо зарегистрироваться или авторизоваться на сайте<a href="// https://sota2u.tmk-group.com/" target="_blank"> https://sota2u.tmk-group.com/</a> или в мобильном приложении SOTA2U"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Цифровые помощники
                "На главную" -> /Вот что я умею

        state: Цифровые помощники || sessionResult = "Цифровые помощники", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Обучение/Цифровые помощники
            a: Супер, вас интересуют цифровые помощники. || htmlEnabled = true, html = "Супер, вас интересуют цифровые помощники."
            buttons:
                "SOTA2U" -> /Комплаенс этика и закон/SOTA2U
                "Корпоративная библиотека" -> /Комплаенс этика и закон/Корпоративная библиотека
                "MOBI2U" -> /Комплаенс этика и закон/MOBI2U
                "Назад" -> /Комплаенс этика и закон/Обучение

        state: Информация об обучении || sessionResult = "Информация об обучении", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Обучение/Информация об обучении
            a: Задать вопросы и получить информацию о социальной поддержке по направлению "Обучение" Вы можете, обратившись в Службу по управлению персоналом Вашей организации / предприятия. || htmlEnabled = true, html = "Задать вопросы и получить информацию о социальной поддержке по направлению "Обучение" Вы можете, обратившись в Службу по управлению персоналом Вашей организации / предприятия."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Обучение
                "На главную" -> /Вот что я умею

        state: Обучение || sessionResult = "Обучение", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Обучение
            a: Конечно, очень важно знать об обучении! || htmlEnabled = true, html = "Конечно, очень важно знать об обучении!"
            buttons:
                "Информация об обучении" -> /Комплаенс этика и закон/Информация об обучении
                "Цифровые помощники" -> /Комплаенс этика и закон/Цифровые помощники
                "Развивающие проекты" -> /Комплаенс этика и закон/Развивающие проекты
                "Назад" -> /Комплаенс этика и закон/Социальная поддержка

        state: Санатории для оздоровления работающих во вредных условиях труда || sessionResult = "Для вредных условий труда", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Санаторно-курортный отдых и оздоровление new/Санатории для оздоровления работающих во вредных условиях труда
            a: Санаторно-курортное лечение работникам предприятия проводится за счет средств ФСС и работодателя в случае, если по результатам профосмотра врачебной комиссией оно было рекомендовано работнику. 
                Задать вопросы и получить информацию о порядке санаторно-курортного лечения занятым на работах во вредных условиях труда Вы можете, обратившись в Службу по охране труда и промышленной безопасности Вашего предприятия. 
                Санаторно-курортное лечение осуществляется во время очередного отпуска работника. || htmlEnabled = true, html = "Санаторно-курортное лечение работникам предприятия проводится за счет средств ФСС и работодателя в случае, если по результатам профосмотра врачебной комиссией оно было рекомендовано работнику.&nbsp;<br>Задать вопросы и получить информацию о порядке санаторно-курортного лечения занятым на работах во вредных условиях труда Вы можете, обратившись в Службу по охране труда и промышленной безопасности Вашего предприятия.&nbsp;<br>Санаторно-курортное лечение осуществляется во время очередного отпуска работника."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Санаторно-курортный отдых и оздоровление
                "На главную" -> /Вот что я умею

        state: Отдых на Базе отдыха "Сосновый Бор", Свердловская область || sessionResult = "БО Сосновый бор", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Санаторно-курортный отдых и оздоровление new/Отдых на Базе отдыха Сосновый Бор, Свердловская область
            a: Отдых на Базе отдыха Сосновый Бор, Свердловская область.
                Отдых и оздоровление работников предприятий / организаций ТМК осуществляется на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии положением.
                Продолжительность путевки - на Ваше усмотрение. 
                Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику. || htmlEnabled = true, html = "<b>Отдых на Базе отдыха Сосновый Бор, Свердловская область.</b><br>Отдых и оздоровление работников предприятий / организаций ТМК осуществляется на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии положением.<br><ul><li>Продолжительность путевки - на Ваше усмотрение.&nbsp;</li><li>Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику.</li></ul>"
            a: В стоимость путевки входит: 
                
                Проживание.
                3х-разовое питание.
                Пользование пляжем и спортивной инфраструктурой. 
                
                Узнать больше о БО Сосновый бор Вы можете здесь: http://baza-sb.ru/?ysclid=l6utuuc8i1452209767 || htmlEnabled = true, html = "В стоимость путевки входит:&nbsp;<br><ul><li>Проживание.</li><li>3х-разовое питание.</li><li>Пользование пляжем и спортивной инфраструктурой.&nbsp;</li></ul><br>Узнать больше о БО Сосновый бор Вы можете здесь: <a href="http://baza-sb.ru/?ysclid=l6utuuc8i1452209767" target="_blank">http://baza-sb.ru/?ysclid=l6utuuc8i1452209767</a>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Санаторно-курортный отдых и оздоровление
                "На главную" -> /Вот что я умею

        state: Отдых на Базе отдыха "Трубник", Свердловская область || sessionResult = "БО Трубник", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Санаторно-курортный отдых и оздоровление new/Отдых на Базе отдыха Трубник, Свердловская область
            a: Отдых на Базе отдыха Трубник, Свердловская область
                Отдых и оздоровление работников предприятий / организаций ТМК осуществляется на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии Положением.
                Продолжительность путевки - на Ваше усмотрение. 
                Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику. || htmlEnabled = true, html = "<b>Отдых на Базе отдыха Трубник, Свердловская область</b><br><span style="letter-spacing: 0px;">Отдых и оздоровление работников предприятий / организаций ТМК осуществляется на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии Положением.</span><br><ul><li><span style="letter-spacing: 0px;">Продолжительность путевки  - на Ваше усмотрение.&nbsp;</span></li><li><span style="letter-spacing: 0px;">Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику.</span></li></ul>"
            a: В стоимость путевки входит:
                
                Проживание.
                3х-разовое питание.
                Пользование пляжем и спортивной инфраструктурой. || htmlEnabled = true, html = "В стоимость путевки входит: <br><ul><li>Проживание.</li><li>3х-разовое питание.</li><li>Пользование пляжем и спортивной инфраструктурой.</li></ul>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Санаторно-курортный отдых и оздоровление
                "На главную" -> /Вот что я умею

        state: Отдых в Пансионате Тополь, Ростовская область || sessionResult = "Пансионат Тополь", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Санаторно-курортный отдых и оздоровление new/Отдых в Пансионате Тополь, Ростовская область
            a: Отдых в Пансионате Тополь, Ростовская область
                Санаторно-курортное лечение работникам предприятий / организаций ТМК осуществляется на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии положением.
                
                Продолжительность путевки составляет 7 - 21 дней.
                Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику. || htmlEnabled = true, html = "<b>Отдых в Пансионате Тополь, Ростовская область</b><br>Санаторно-курортное лечение работникам предприятий / организаций ТМК осуществляется на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии положением.<br><ul><li>Продолжительность путевки составляет 7  - 21 дней.</li><li>Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику.</li></ul>"
            a: Для работников ТАГМЕТ возможно оздоровление без отрыва от производства, в формате "вечерний санаторий". 
                В стоимость путевки входит: 
                
                Проживание.
                3х-разовое питание. 
                Физиолечение по профилю основного заболевания. 
                Пользование пляжем.
                 Узнать больше о Пансионате Тополь Вы можете здесь:
                http://priazovie-spa.ru/sanatorij || htmlEnabled = true, html = "<b>Для работников ТАГМЕТ</b> возможно оздоровление без отрыва от производства, в формате "вечерний санаторий".&nbsp;<br>В стоимость путевки входит:&nbsp;<br><ul><li>Проживание.</li><li>3х-разовое питание.&nbsp;</li><li>Физиолечение по профилю основного заболевания.&nbsp;</li><li>Пользование пляжем.</li></ul>&nbsp;Узнать больше о Пансионате Тополь Вы можете здесь:<br><a href="http://priazovie-spa.ru/sanatorij" target="_blank">http://priazovie-spa.ru/sanatorij</a>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Санаторно-курортный отдых и оздоровление
                "На главную" -> /Вот что я умею

        state: Отдых в Гостиничном комплексе "Романтик", Карачаево-Черкесия || sessionResult = "ГК Романтик", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Санаторно-курортный отдых и оздоровление new/Отдых в Гостиничном комплексе "Романтик", Карачаево-Черкесия
            a: Отдых в Гостиничном комплексе Романтик, Карачаево-Черкесия.
                Оздоровительные путевки в ГК "Романтик" работникам предприятий / организаций ТМК предоставляются на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии положением.
                Продолжительность путевки составляет 7 или 14 дней. 
                Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику. || htmlEnabled = true, html = "<b>Отдых в Гостиничном комплексе Романтик, Карачаево-Черкесия.</b><br><span style="letter-spacing: 0px;">Оздоровительные путевки в ГК "Романтик" работникам предприятий / организаций ТМК предоставляются на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии положением.</span><ul><li>Продолжительность путевки составляет 7 или 14 дней.&nbsp;</li><li>Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику.</li></ul>"
            a: В стоимость путевки входит:
                
                Проживание.
                3х-разовое питание.
                Трансфер.
                Кавказские Минеральные Воды - ГК Романтик - Кавказские Минеральные Воды.
                Некоторые виды физиолечения по профилю основного заболевания.
                Узнать больше о ГК Романтик Вы можете здесь:
                https://hotelromantik.ru/ || htmlEnabled = true, html = "В стоимость путевки входит: <br><ul><li>Проживание. </li><li>3х-разовое питание.</li><li>Трансфер.</li><li>Кавказские Минеральные Воды - ГК Романтик - Кавказские Минеральные Воды.</li><li>Некоторые виды физиолечения по профилю основного заболевания. </li></ul>Узнать больше о ГК Романтик Вы можете здесь:<br><a href="https://hotelromantik.ru/" target="_blank">https://hotelromantik.ru/</a>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Санаторно-курортный отдых и оздоровление
                "На главную" -> /Вот что я умею

        state: Отдых в Пансионате Бургас Краснодарский край || sessionResult = "Пансионат Бургас", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Санаторно-курортный отдых и оздоровление new/Отдых в Пансионате Бургас, Краснодарский край
            a: Отдых в Пансионате Бургас, Краснодарский край
                Санаторно-курортное лечение работникам предприятий / организаций ТМК осуществляется на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии Положением.
                
                Продолжительность путевки составляет 7 или 14 дней. 
                Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику. || htmlEnabled = true, html = "Отдых в Пансионате Бургас, Краснодарский край<br>Санаторно-курортное лечение работникам предприятий / организаций ТМК осуществляется на условиях софинансирования работодателя и работника в соответствии с действующим на предприятии Положением.<br><ul><li>Продолжительность путевки составляет 7 или 14 дней.&nbsp;</li><li>Сроки путевки должны укладываться в период очередного отпуска работника, согласно утвержденному графику.</li></ul>"
            a: В стоимость путевки входит: 
                Проживание.
                3х-разовое питание.
                Физиолечение по профилю основного заболевания.
                Пользование пляжем.
                Открытым бассейном. 
                Узнать больше о Пансионате Бургас Вы можете здесь: https://burgas-pansion.ru || htmlEnabled = true, html = "В стоимость путевки входит:&nbsp;<br><ul><li>Проживание.</li><li>3х-разовое питание.</li><li>Физиолечение по профилю основного заболевания.</li><li>Пользование пляжем.</li><li>Открытым бассейном.&nbsp;</li></ul>Узнать больше о Пансионате Бургас Вы можете здесь: <a href="https://burgas-pansion.ru" target="_blank">https://burgas-pansion.ru</a>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Санаторно-курортный отдых и оздоровление
                "На главную" -> /Вот что я умею

        state: Информация об отдыхе и оздоровлении || sessionResult = "Информация об отдыхе и оздоровлении", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Санаторно-курортный отдых и оздоровление new/Информация об отдыхе и оздоровлении
            a: Задать вопросы и получить информацию о социальной поддержке по направлению "Санаторно-курортный отдых и оздоровление" Вы можете, обратившись в Службу по управлению персоналом Вашей организации / предприятия. || htmlEnabled = true, html = "Задать вопросы и получить информацию о социальной поддержке по направлению "Санаторно-курортный отдых и оздоровление" Вы можете, обратившись в Службу по управлению  персоналом Вашей организации / предприятия."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Санаторно-курортный отдых и оздоровление
                "На главную" -> /Вот что я умею

        state: Санаторно-курортный отдых и оздоровление || sessionResult = "Санаторно-курортный отдых", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка/Санаторно-курортный отдых и оздоровление new/Санаторно-курортный отдых и оздоровление
            a: Отлично, есть информация о санаторно-курортном отдыхе и оздоровлении. || htmlEnabled = true, html = "Отлично, есть информация о санаторно-курортном отдыхе и оздоровлении."
            buttons:
                "Информация об отдыхе и оздоровлении" -> /Комплаенс этика и закон/Информация об отдыхе и оздоровлении
                "Пансионат Бургас" -> /Комплаенс этика и закон/Отдых в Пансионате Бургас Краснодарский край
                "ГК Романтик" -> /Комплаенс этика и закон/Отдых в Гостиничном комплексе "Романтик", Карачаево-Черкесия
                "Пансионат Тополь" -> /Комплаенс этика и закон/Отдых в Пансионате Тополь, Ростовская область
                "БО Трубник" -> /Комплаенс этика и закон/Отдых на Базе отдыха "Трубник", Свердловская область
                "БО Сосновый Бор" -> /Комплаенс этика и закон/Отдых на Базе отдыха "Сосновый Бор", Свердловская область
                "Санатории для оздоровления работающих во вредных условиях труда" -> /Комплаенс этика и закон/Санатории для оздоровления работающих во вредных условиях труда
                "Назад" -> /Комплаенс этика и закон/Социальная поддержка

        state: Охрана труда Ответственность за нарушения || sessionResult = "Охрана труда, ответственность за нарушения", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Охрана труда/Ответственность за нарушения
            a: Согласно правилам использования имущества Компании, любые нарушения требований охраны труда – нарушения трудовой дисциплины. 
                Они влекут применение строгих взысканий.
                Сотрудники, не соблюдающие правила и требования охраны труда, могут быть привлечены к дисциплинарной ответственности вплоть до увольнения, а также к иной установленной законом ответственности вне зависимости от занимаемой должности или стажа работы в Компании. (Источник: п. 4.2.1 и 4.2.3 Кодекса Этики). || htmlEnabled = true, html = "Согласно правилам использования имущества Компании, любые нарушения требований охраны труда – нарушения трудовой дисциплины.&nbsp;<br><b>Они влекут применение строгих взысканий.</b><br>Сотрудники, не соблюдающие правила и требования охраны труда, могут быть привлечены к дисциплинарной ответственности вплоть до увольнения, а также к иной установленной законом ответственности вне зависимости от занимаемой должности или стажа работы в Компании. (Источник: п. 4.2.1 и 4.2.3 Кодекса Этики).<br>"
            a: Известно о нарушении?
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Охрана труда
                "На главную" -> /Вот что я умею

        state: Охрана труда Вам не следует || sessionResult = "Охрана труда, вам не следует", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Охрана труда/Вам не следует
            a: Правила и нормы охраны труда Вам НЕ СЛЕДУЕТ:
                Приступать к работе в состоянии болезни, под воздействием алкоголя, наркотиков, медицинских препаратов.
                Выполнять трудовые обязанности с нарушением правил охраны труда, руководствуясь принципами «пронесет», «не страшно», а также иными принципами, идущими вразрез с требованиями безопасности. 
                Закрывать глаза на факты нарушения другими сотрудниками требований охраны труда. (Источник: стр. 18-19 Кодекса Этики). || htmlEnabled = true, html = "<span style="letter-spacing: 0px;">Правила и нормы охраны труда Вам НЕ СЛЕДУЕТ:</span><br><ul><li><span style="letter-spacing: 0px;">Приступать к работе в состоянии болезни, под воздействием алкоголя, наркотиков, медицинских препаратов.</span></li><li><span style="letter-spacing: 0px;">Выполнять трудовые обязанности с нарушением правил охраны труда, руководствуясь принципами «пронесет», «не страшно», а также иными принципами, идущими вразрез с требованиями безопасности.&nbsp;</span></li><li><span style="letter-spacing: 0px;">Закрывать глаза на факты нарушения другими сотрудниками требований охраны труда. (Источник: стр. 18-19 Кодекса Этики).</span></li></ul>"
            a: Известно о нарушении?
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Охрана труда
                "На главную" -> /Вот что я умею

        state: Охрана труда Вам следует || sessionResult = "Охрана труда, вам следует", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Охрана труда/Вам следует
            a: Правила и нормы охраны труда Вам СЛЕДУЕТ:
                Знать и соблюдать правила и процедуры Компании в области охраны труда и техники безопасности. 
                Приступать к работе, только если вы обучены тому, как ее проводить, и имеете инструменты и средства индивидуальной защиты для ее выполнения. 
                Проинформировать руководство Компании о ситуациях, создающих угрозу причинения вреда жизни или здоровью людей, а также по возможности пресечь опасную ситуацию. (Источник: стр. 18 Кодекса Этики). || htmlEnabled = true, html = "Правила и нормы охраны труда Вам СЛЕДУЕТ:<br><ul><li>Знать и соблюдать правила и процедуры Компании в области охраны труда и техники безопасности.&nbsp;</li><li>Приступать к работе, только если вы обучены тому, как ее проводить, и имеете инструменты и средства индивидуальной защиты для ее выполнения.&nbsp;</li><li>Проинформировать руководство Компании о ситуациях, создающих угрозу причинения вреда жизни или здоровью людей, а также по возможности пресечь опасную ситуацию. (Источник: стр. 18 Кодекса Этики).</li></ul>"
            a: Известно о нарушении?
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Охрана труда
                "На главную" -> /Вот что я умею


        
        state: Что такое охрана труда? || sessionResult = "Что такое охрана труда", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Охрана труда/Что такое охрана труда?
            a: Охрана труда
                Система сохранения жизни и здоровья работников в процессе трудовой деятельности, включающая в себя правовые, социально-экономические, организационно-технические, санитарно-гигиенические, лечебно-профилактические, реабилитационные и иные мероприятия.  || htmlEnabled = true, html = "<b>Охрана труда</b><br>Система сохранения жизни и здоровья работников в процессе трудовой деятельности, включающая в себя правовые, социально-экономические, организационно-технические, санитарно-гигиенические, лечебно-профилактические, реабилитационные и иные мероприятия.&nbsp;<br>"
            a: Стандарты безопасности труда – правила, процедуры, критерии и нормативы, направленные на сохранение жизни и здоровья работников в процессе трудовой деятельности и регламентирующие осуществление социально-экономических, организационных, санитарно-гигиенических, лечебно-профилактических, реабилитационных мер в области охраны труда. (Источник: ст. 209 ТК РФ). || htmlEnabled = true, html = "Стандарты безопасности труда – правила, процедуры, критерии и нормативы, направленные на сохранение жизни и здоровья работников в процессе трудовой деятельности и регламентирующие осуществление социально-экономических, организационных, санитарно-гигиенических, лечебно-профилактических, реабилитационных мер в области охраны труда. (Источник: ст. 209 ТК РФ).<br>"
            a: Известно о нарушении?
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Охрана труда
                "На главную" -> /Вот что я умею

        state: Ответственность за нарушения || sessionResult = "Имущество, ответственность за нарушения", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Этика Закон/Использование имущества Компании/Ответственность за нарушения
            a: Согласно правилам использования имущества Компании, сотрудник несет ответственность за: 
                
                Кражу.
                Хищение (в т.ч. мелкое).
                Присвоение.
                Растрату.
                Мошенничество в отношении имущества Компании независимо от его стоимости является противозаконным и будет преследоваться Компанией в
                установленном законом порядке.
                 || htmlEnabled = true, html = "Согласно правилам использования имущества Компании, сотрудник несет ответственность за:&nbsp;<br><ul><li>Кражу.</li><li>Хищение (в т.ч. мелкое).</li><li>Присвоение.</li><li>Растрату.</li></ul>Мошенничество в отношении имущества Компании независимо от его стоимости является противозаконным и будет преследоваться Компанией в<br>установленном законом порядке.<br>"
            a: В случае выявления фактов хищения виновный сотрудник может быть привлечен к дисциплинарной ответственности (вплоть до увольнения) и иной установленной законом ответственности (вплоть до уголовной) вне зависимости от занимаемой должности или стажа работы в Компании. (Источники: УК РФ, п. 4.3.4 Кодекса Этики). || htmlEnabled = true, html = "В случае выявления фактов хищения виновный сотрудник может быть привлечен к дисциплинарной ответственности (вплоть до увольнения) и иной установленной законом ответственности (вплоть до уголовной) вне зависимости от занимаемой должности или стажа работы в Компании. (Источники: УК РФ, п. 4.3.4 Кодекса Этики)."
            a: Известно о нарушении?
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank" style="">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Использование имущества Компании
                "На главную" -> /Вот что я умею

        state: Вам не следует || sessionResult = "Имущество, вам не следует", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Этика Закон/Использование имущества Компании/Вам не следует
            a: Согласно правилам использования имущества Компании, Вам НЕ СЛЕДУЕТ:
                Использовать имущество Компании (в т.ч. инструменты и инвентарь) в личных целях. 
                Выносить имущество Компании для личного использования или передачи третьим лицам.
                Помните: "унести с работы для себя", "прихватить" – означает украсть! (Источник: стр. 19 Кодекса Этики). || htmlEnabled = true, html = "Согласно правилам использования имущества Компании, Вам НЕ СЛЕДУЕТ:<br><ul><li>Использовать имущество Компании (в т.ч. инструменты и инвентарь) в личных целях.&nbsp;</li><li>Выносить имущество Компании для личного использования или передачи третьим лицам.</li><li>Помните: "унести с работы для себя", "прихватить" – означает украсть! (Источник: стр. 19 Кодекса Этики).</li></ul>"
            a: Известно о нарушении? 
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<b>&nbsp;</b><br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Использование имущества Компании
                "На главную" -> /Вот что я умею

        state: Вам следует || sessionResult = "Имущество, вам следует", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Этика Закон/Использование имущества Компании/Вам следует
            a: Согласно правилам использования имущества Компании, Вам СЛЕДУЕТ: 
                
                Использовать имущество Компании эффективно, рационально и в служебных целях. 
                Обеспечить сохранность имущества Компании и имущества третьих лиц, находящегося у Компании. 
                Бережно обращаться с имуществом Компании и имуществом третьих лиц, находящихся в Компании. (Источник: стр. 19 Кодекса Этики). || htmlEnabled = true, html = "Согласно правилам использования имущества Компании, Вам СЛЕДУЕТ:&nbsp;<br><ul><li>Использовать имущество Компании эффективно, рационально и в служебных целях.&nbsp;</li><li>Обеспечить сохранность имущества Компании и&nbsp;имущества третьих лиц, находящегося у Компании.&nbsp;</li><li>Бережно обращаться с имуществом Компании и имуществом третьих лиц, находящихся в Компании. (Источник: стр. 19 Кодекса Этики).</li></ul>"
            a: Известно о нарушении?
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Использование имущества Компании
                "На главную" -> /Вот что я умею

        state: Что такое хищение? || sessionResult = "Что такое хищение", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Этика Закон/Использование имущества Компании/Что такое хищение?
            a: Под хищением понимают совершенное с корыстной целью противоправное изъятие и (или) обращение чужого имущества в пользу виновного или других лиц, причинивших ущерб собственнику или иному владельцу этого имущества. (Источник: ст. 158 УК РФ).
                 || htmlEnabled = true, html = "Под хищением понимают совершенное с корыстной целью противоправное изъятие и (или) обращение чужого имущества в пользу виновного или других лиц, причинивших ущерб собственнику или иному владельцу этого имущества. (Источник: ст. 158 УК РФ).<br>"
            a: Известно о нарушении? 
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?&nbsp;<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Использование имущества Компании
                "На главную" -> /Вот что я умею

        state: Начало
            a: Хорошо, что вы проявляете интерес к законам, а также к этике и комплаенс-системе компании. Эти аспекты очень важны, поэтому важно их знать и соблюдать. || htmlEnabled = true, html = "Хорошо, что вы проявляете интерес к законам, а также к этике и комплаенс-системе компании. Эти аспекты очень важны, поэтому важно их знать и соблюдать."
            buttons:
                "Этика и Закон" -> /Комплаенс этика и закон/Этика Закон
                "Горячая линия" -> /Комплаенс этика и закон/Горячая линия
                "Охрана труда" -> /Комплаенс этика и закон/Охрана труда
                "Назад" -> /Вот что я умею

        state: Этика Закон
            intent!: /Комплаенс этика и закон/Этика Закон
            a: Как хорошо, что вы обратили внимание на этику и закон! || htmlEnabled = true, html = "Как хорошо, что вы обратили внимание на этику и закон!"
            buttons:
                "Злоупотребление полномочиями" -> /Комплаенс этика и закон/Злоупотребление полномочиями
                "Взятка и Коррупция" -> /Комплаенс этика и закон/Взятка и Коррупция
                "Использование имущества Компании" -> /Комплаенс этика и закон/Использование имущества Компании
                "Назад" -> /Комплаенс этика и закон/Начало

        state: Злоупотребление полномочиями || sessionResult = "Злоупотребление полномочиями", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Этика Закон/Злоупотребление полномочиями
            a: Злоупотребление полномочиями:
                Форма коррупции. 
                Является преступлением и преследуются по закону (Источники: ФЗ № 273 от 25.12.08, ст. 201 УК РФ). || htmlEnabled = true, html = "<b>Злоупотребление полномочиями:</b><br><ul><li><span style="letter-spacing: 0px;">Форма коррупции.&nbsp;</span></li><li><span style="letter-spacing: 0px;">Является преступлением и преследуются по закону (Источники: ФЗ № 273 от 25.12.08, ст. 201 УК РФ).</span></li></ul>"
            a: Сотрудникам ТМК запрещено: 
                Использовать свое должностное положение в ущерб законным интересам Компании, общества и государства в целях.
                Получения выгоды в виде денег, ценностей.
                Иного имущества или услуг имущественного характера.
                Иных имущественных прав для себя или для третьих лиц, либо незаконное предоставление такой выгоды указанному лицу другими физическими лицами.
                (Источник: п.3.2.2 Кодекса Этики). || htmlEnabled = true, html = "Сотрудникам ТМК запрещено:&nbsp;<br><ul><li>Использовать свое должностное положение в ущерб законным интересам Компании,&nbsp;общества и государства в целях.</li><li>Получения выгоды в виде денег, ценностей.</li><li>Иного имущества или услуг имущественного характера.</li><li>Иных имущественных прав для себя или для третьих лиц, либо незаконное предоставление такой выгоды указанному лицу другими физическими лицами.</li></ul>(Источник: п.3.2.2 Кодекса Этики).<br>"
            a: Известно о нарушении?
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Этика Закон
                "На главную" -> /Вот что я умею

        state: Взятка и Коррупция || sessionResult = "Взятка и коррупция", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Этика Закон/Взятка и Коррупция
            a: Очень важно знать о теме взяток и коррупции! || htmlEnabled = true, html = "Очень важно знать о теме взяток и коррупции!"
            buttons:
                "Что такое взятка?" -> /Комплаенс этика и закон/Что такое взятка?
                "Взятка или подарок?" -> /Комплаенс этика и закон/Взятка или подарок?
                "Назад" -> /Комплаенс этика и закон/Этика Закон
        state: Что такое взятка? || sessionResult = "Что такое взятка", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Этика Закон/Взятка и Коррупция/Что такое взятка?
            a: Взятка – это форма коррупции (Источник: п.3.2.2 Кодекса Этики). Действия, связанные со взяточничеством, являются преступлениями и преследуются по закону (Источники: ст. 290, 291, 291.1, 291.2 УК РФ).
                 || htmlEnabled = true, html = "Взятка – это форма коррупции (Источник: п.3.2.2 Кодекса Этики). Действия, связанные со взяточничеством, являются преступлениями и преследуются по закону (Источники: ст. 290, 291, 291.1, 291.2 УК РФ).<br>"
            a: Сотрудникам ТМК строго запрещено:
                Давать и получать взятки.
                Быть соучастником получения/дачи/вымогательства взятки.
                Участвовать в представительских мероприятиях, если последние могут быть восприняты участниками и/или окружающими как взятка. 
                (Источники: п. 3.2.2 и п. 3.4.11 Кодекса Этики). || htmlEnabled = true, html = "Сотрудникам ТМК строго запрещено:<br><ul><li>Давать и получать взятки.</li><li>Быть соучастником получения/дачи/вымогательства взятки.</li><li>Участвовать в представительских мероприятиях, если последние могут быть восприняты участниками и/или окружающими как взятка.&nbsp;</li></ul>(Источники: п. 3.2.2 и п. 3.4.11 Кодекса Этики).<br>"
            a: Известно о нарушении?
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Взятка и Коррупция
                "На главную" -> /Вот что я умею
                
        state: Взятка или подарок? || sessionResult = "Взятка или подарок", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Этика Закон/Взятка и Коррупция/Взятка или подарок?
            a: Отличием подарка от взятки является его безвозмездность. 
                Передавая подарок, даритель ничего не пытается получить взамен, в том числе какие-либо ответные действия (бездействие) в его интересах со стороны должностного лица в связи с его служебным положением. || htmlEnabled = true, html = "Отличием подарка от взятки является его безвозмездность.&nbsp;<br><span style="letter-spacing: 0px;">Передавая подарок, даритель ничего не пытается получить взамен, в том числе какие-либо ответные действия (бездействие) в его интересах со стороны должностного лица в связи с его служебным положением.</span>"
            a: Известно о нарушении?
                Сообщите на горячую линию!
                Гарантируем Вам полную конфиденциальность и защиту. || htmlEnabled = true, html = "Известно о нарушении?<br><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">Сообщите на горячую линию!</a><br>Гарантируем Вам полную конфиденциальность и защиту."
            buttons:
                "Назад" -> /Комплаенс этика и закон/Взятка и Коррупция
                "На главную" -> /Вот что я умею

        state: Использование имущества Компании || sessionResult = "Использование имущества компании", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Этика Закон/Использование имущества Компании
            a: Использование имущества Компании || htmlEnabled = true, html = "Использование имущества Компании"
            buttons:
                "Что такое хищение?" -> /Комплаенс этика и закон/Что такое хищение?
                "Вам следует" -> /Комплаенс этика и закон/Вам следует
                "Вам не следует" -> /Комплаенс этика и закон/Вам не следует
                "Ответственность за нарушения" -> /Комплаенс этика и закон/Ответственность за нарушения
                "Назад" -> /Комплаенс этика и закон/Этика Закон

        state: Горячая линия || sessionResult = "Горячая линия", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Горячая линия
            a: Гарантируем вам полную конфиденциальность и защиту. На горячую линию можно обратиться:
                
                По тел. доверия 8-800-700-8072 (бесплатно в любое время суток, из любой точки страны);
                На адрес эл. почты: 8072@tmk-group.com (с любого e-mail);
                По почте на адрес: 101000, Российская Федерация, г. Москва, ул. Покровка, д. 40, стр. 2А, Комитет по регулированию комплаенс-рисков.
                Ознакомиться с подробной информацией и с «Памяткой по пользованию горячей линией» Вы можете здесь.
                 || htmlEnabled = true, html = "Гарантируем вам полную конфиденциальность и защиту. На горячую линию можно обратиться: <br><ul><li>По тел. доверия 8-800-700-8072 (бесплатно в любое время суток, из любой точки страны); </li><li>На адрес эл. почты: <b><a href="https://portal.tmk-group.com/services/hotline/" target="_blank">8072@tmk-group.com</a> </b>(с любого e-mail); </li><li>По почте на адрес: 101000, Российская Федерация, г. Москва, ул. Покровка, д. 40, стр. 2А, Комитет по регулированию комплаенс-рисков.</li></ul><div>Ознакомиться с подробной информацией и с «Памяткой по пользованию горячей линией» Вы можете <a href="https://portal.tmk-group.com/services/hotline/" target="_blank">здесь</a>.<br></div>"
            buttons:
                "Назад" -> /Комплаенс этика и закон/Начало
                "На главную" -> /Вот что я умею

        state: Охрана труда || sessionResult = "Охрана труда", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Охрана труда
            a: Спасибо за интерес к охране труда. || htmlEnabled = true, html = "Спасибо за интерес к охране труда."
            buttons:
                "Что такое охрана труда?" -> /Комплаенс этика и закон/Что такое охрана труда?
                "Вам следует" -> /Комплаенс этика и закон/Охрана труда Вам следует
                "Вам не следует" -> /Комплаенс этика и закон/Охрана труда Вам не следует
                "Ответственность за нарушения" -> /Комплаенс этика и закон/Охрана труда Ответственность за нарушения
                "Назад" -> /Комплаенс этика и закон/Начало

        state: Социальная поддержка || sessionResult = "Социальная поддержка", sessionResultColor = "#FFFFFF"
            intent!: /Комплаенс этика и закон/Социальная поддержка
            a: У меня много информации о социальной поддержке. || htmlEnabled = true, html = "У меня много информации о социальной поддержке."
            buttons:
                "Санаторно-курортный отдых и оздоровление" -> /Комплаенс этика и закон/Санаторно-курортный отдых и оздоровление
                "Обучение" -> /Комплаенс этика и закон/Обучение
                "Медицина" -> /Комплаенс этика и закон/Медицина
                "Назад" -> /Вот что я умею

    state: Нужно что-нибудь еще
        go!: /Нужно что-нибудь еще/Начало
        
        state: Начало
            script:
                $session.wasDataProcessingAgreement = false;
            buttons:
                "На главную " -> /Нужно что-нибудь еще/Да
                "Завершить сеанс" -> /Нужно что-нибудь еще/Нет
            intent: /Да || toState = "/Нужно что-нибудь еще/Да"
            intent: /Нет || toState = "/Нужно что-нибудь еще/Нет"
            intent: /Вот что я умею || toState = "/Вот что я умею"
            event: noMatch || toState = "/NoMatch"
        state: Да
            go!: /Вот что я умею
        state: Нет
            a: Надеюсь я был полезен
            go!: /Bye
        

    state: Обратная связь || sessionResult = "Обратная связь", sessionResultColor = "#15952F"
        intent!: /Обратная связь
        go!: /Обратная связь/начало

        state: Оправить и создать новое OK
            a: Ваше предложение отправлено и будет рассмотрено нашими специалистами. {{$session.ИО}}, спасибо за вашу помощь! || htmlEnabled = true, html = "Ваше предложение отправлено и будет рассмотрено нашими специалистами. {{$session.ИО}}, спасибо за вашу помощь!"
            go!: /Обратная связь

        state: Оправить и создать новое
            Email: 
                destination = digital@tmk-group.com
                subject = Предложения
                text = {{ОтправитьПредложениеЭлектроннаяПочта()}}
                files = []
                html = {{ОтправитьПредложениеЭлектроннаяПочта()}}
                htmlEnabled = true
                okState = /Обратная связь/Оправить и создать новое OK
                errorState = /Обратная связь/Error

        state: Проверка имени
            if: $session.startData
                script:
                    $session.ФИО = $session.startData.surname + " " + $session.startData.name + " " + $session.startData.patname;
                    $session.ИО = $session.startData.name + " " + $session.startData.patname;
                go!: /Обратная связь/Предложение
            else: 
                go!: /Обратная связь/Ф.И.О.

        state: Ok
            a: Ваше предложение отправлено и будет рассмотрено нашими специалистами.
                {{$session.ИО}}, спасибо за вашу помощь! || htmlEnabled = true, html = "Ваше предложение отправлено и будет рассмотрено нашими специалистами. {{$session.ИО}}, спасибо за вашу помощь!"
            buttons:
                "Назад" -> /Обратная связь
                "На главную" -> /Вот что я умею

        state: Error
            a: Что-то пошло не так. Ваше предложение не было отправлено. 
                Пожалуйста, повторите попытку позже. || htmlEnabled = true, html = "Что-то пошло не так. Ваше предложение не было отправлено.&nbsp;<br><br>Пожалуйста, повторите попытку позже."
            buttons:
                "Назад" -> /Обратная связь 
                "На главную" -> /Вот что я умею

        state: End
            a: ваше предложение НЕ было отправлено || htmlEnabled = true, html = "ваше предложение <b>НЕ</b> было отправлено"
            buttons:
                "Назад" -> /Обратная связь 
                "На главную" -> /Вот что я умею

        state: Предложение
            if: !$session.startData
                script: $session.ИО = $session.ФИО;
                    
            a: Вы хотите отправить предложение?
            buttons:
                "Да" -> /Обратная связь/Отправить предложение
                "Нет" -> /Обратная связь/End
                "Оправить и создать новое" -> /Обратная связь/Оправить и создать новое
            intent: /Да || toState = "/Обратная связь/Отправить предложение"
            intent: /Нет || toState = "/Обратная связь/End"
            intent: /Оправить и создать новое || toState = "/Обратная связь/Оправить и создать новое"
            event: noMatch || toState = "/Обратная связь/Предложение"

        state: Отправить предложение
            Email: 
                destination = digital@tmk-group.com
                subject = Предложения
                text = {{ОтправитьПредложениеЭлектроннаяПочта()}}
                files = []
                html = {{ОтправитьПредложениеЭлектроннаяПочта()}}
                htmlEnabled = true
                okState = /Обратная связь/Ok
                errorState = /Обратная связь/Error

        state: Ф.И.О.
            InputText: 
                prompt = Введите Ф.И.О.
                varName = ФИО
                html = 
                htmlEnabled = false
                then = /Обратная связь/Предложение
                actions = {}

        state: начало
            a: Мы стремимся улучшить ТеМКу, поэтому будем рады вашим предложениям. 
                В этом разделе вы также можете запросить дополнительные услуги для этого бота. || htmlEnabled = true, html = "Мы стремимся улучшить ТеМКу, поэтому будем рады вашим предложениям.&nbsp;<br>В этом разделе вы также можете запросить дополнительные услуги для этого бота."
            InputText: 
                prompt = Введите ваше предложение:
                varName = предложение
                html = 
                htmlEnabled = false
                then = /Обратная связь/Проверка имени
                actions = {}

    state: Кафе Москва || sessionResult = "Кафе Москва", sessionResultColor = "#143AD1"
        intent!: /Кафе Москва
        go!: /Кафе Москва/начало
        
        
        state: Калории || sessionResult = "Калории", sessionResultColor = "#FFFFFF"
            a: Какая информация о калориях вам нужна? || htmlEnabled = true, html = "Какая информация о калориях вам нужна?"
            buttons:
                "Калькулятор калорий" -> /Кафе Москва/Калькулятор калорий
                "Норма калорий" -> /Кафе Москва/Норма калорий
                "Назад" -> /Кафе Москва/начало
                "На главную" -> /Вот что я умею

        state: Калькулятор калорий || sessionResult = "Калькулятор калорий", sessionResultColor = "#FFFFFF"
            intent!: /Кафе Москва/Калории/Калькулятор калорий
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
            else: 
                go!: /У нас нет для вас информации
            a: Калькулятор калорий, встроенный в меню кафе – отличный помощник для тех, кто следит за питанием.
                Не знаете свою суточную норму калорий?
                Рассчитайте ее на портале!
                Достигайте своих целей, придерживаясь здорового образа жизни! || htmlEnabled = true, html = "Калькулятор калорий, встроенный в меню кафе – отличный помощник для тех, кто следит за питанием.<br>Не знаете свою суточную норму калорий?<br><a href="https://portal.tmk-group.com/services/cafe/msk/pokrovka" target="_blank">Рассчитайте ее на портале!</a> <br>Достигайте своих целей, придерживаясь здорового образа жизни!"
            buttons:
                "Назад" -> /Кафе Москва
                "На главную" -> /Вот что я умею

        state: Норма калорий || sessionResult = "Норма калорий", sessionResultColor = "#FFFFFF"
            intent!: /Кафе Москва/Калории/Норма калорий
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
            else: 
                go!: /У нас нет для вас информации
            a: Не знаете свою суточную норму калорий?
                Рассчитайте ее на портале!
                Вы сможете следить за питанием и достигать своих целей, придерживаясь здорового образа жизни.
                Сверяйте норму калорий с суммой съеденных калорий, рассчитанную с помощью калькулятора калорий. || htmlEnabled = true, html = "Не знаете свою суточную норму калорий?<br><a href="https://portal.tmk-group.com/services/cafe/msk/pokrovka" target="_blank">Рассчитайте ее на портале!</a> <br>Вы сможете следить за питанием и достигать своих целей, придерживаясь здорового образа жизни.<br>Сверяйте норму калорий с суммой съеденных калорий, рассчитанную с помощью калькулятора калорий."
            buttons:
                "Назад" -> /Кафе Москва
                "На главную" -> /Вот что я умею

        state: Обед || sessionResult = "Обед", sessionResultColor = "#FFFFFF"
            intent!: /Кафе Москва/Работа кафетерия/Обед
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
                    
            else: 
                go!: /У нас нет для вас информации
                    
                
            a: Обед в кафе с 11:30 до 15:30.
                С меню на сегодня можно ознакомиться по ссылке. || htmlEnabled = true, html = "Обед в кафе с 11:30 до 15:30.<br><a href="https://portal.tmk-group.com/services/cafe/msk/pokrovka" target="_blank">С меню на сегодня можно ознакомиться по ссылке.</a>"
            buttons:
                "На главную" -> /Вот что я умею
                "Назад"->/Кафе Москва

        state: Завтрак || sessionResult = "Завтрак", sessionResultColor = "#FFFFFF"
            intent!: /Кафе Москва/Работа кафетерия/завтрак
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
                    
            else: 
                go!: /У нас нет для вас информации
                    
            a: Вы можете позавтракать с 07:30 до 10:30.
                С меню на сегодня можно ознакомиться по ссылке. || htmlEnabled = true, html = "Вы можете позавтракать с 07:30 до 10:30.<br><a href="https://portal.tmk-group.com/services/cafe/msk/pokrovka" target="_blank">С меню на сегодня можно ознакомиться по ссылке.</a>"
            buttons:
                "На главную" -> /Вот что я умею
                "Назад"->/Кафе Москва

        state: Время работы кафетерия || sessionResult = "Время работы кафетерия", sessionResultColor = "#FFFFFF"
            intent!: /Кафе Москва/Работа кафетерия/Время работы кафетерия
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
                    
            else: 
                go!: /У нас нет для вас информации
                    
            a: Время работы кафетерия с 08:30 до 17:30.
                С подробностями о работе кафе и меню на сегодня Вы можете ознакомиться тут. || htmlEnabled = true, html = "Время работы кафетерия с 08:30 до 17:30.<br><br><a href="https://portal.tmk-group.com/services/cafe/msk/pokrovka/" target="_blank">С подробностями о работе кафе и меню на сегодня Вы можете ознакомиться тут.</a><br><br><br>"
            buttons:
                "Завтрак" -> /Кафе Москва/Завтрак
                "Обед" -> /Кафе Москва/Обед
                "Назад" -> /Кафе Москва/начало
                "На главную" -> /Вот что я умею
            event: noMatch || toState = "./"

        state: Меню в кафе || sessionResult = "Меню в кафе", sessionResultColor = "#FFFFFF"
            intent!: /Кафе Москва/Меню в кафе
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
                    
            else: 
                go!: /У нас нет для вас информации
                    
            a: В сервисе «Кафе» размещено удобное меню на завтрак и обед для сотрудников офисов на Покровке и Сколково.
                Ознакомиться с ценами и калорийностью блюд можно по ссылке. || htmlEnabled = true, html = "В сервисе «Кафе» размещено удобное меню на завтрак и обед для сотрудников офисов на Покровке и Сколково.  <br>Ознакомиться с ценами и калорийностью блюд можно по <a href="https://portal.tmk-group.com/services/cafe/msk/pokrovka" target="_blank">ссылке</a>."
            buttons:
                "На главную" -> /Вот что я умею
                "Назад"->/Кафе Москва

        state: Обратная связь по работе кафе || sessionResult = "Обратная связь по кафе", sessionResultColor = "#FFFFFF"
            intent!: /Кафе Москва/Обратная связь по работе кафе
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
                    
            else: 
                go!: /У нас нет для вас информации
                    
            a: Если у вас возникли вопросы по работе кафе или есть предложения по улучшению его работы – заполните форму обратной связи. || htmlEnabled = true, html = "Если у вас возникли вопросы по работе кафе или есть предложения по улучшению его работы – <a href="https://portal.tmk-group.com/services/cafe/msk/pokrovka" target="_blank">заполните форму обратной связи.</a>"
            buttons:
                "На главную" -> /Вот что я умею
                "Назад"->/Кафе Москва

        state: Камера_в_столовой || sessionResult = "Камера в столовой", sessionResultColor = "#FFFFFF"
            intent!: /Камеры/Камера в столовой
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
                    
            else: 
                go!: /У нас нет для вас информации
                    
            a: Следите за загруженностью кафе по камерам – выбирайте наиболее удобное время для обеда или завтрака, избежав долгих очередей и сэкономив свое время.
                Камеры в кафе можно найти тут. || htmlEnabled = true, html = "Следите за загруженностью кафе по камерам – выбирайте наиболее удобное время для обеда или завтрака, избежав долгих очередей и сэкономив свое время.<br><a href="https://portal.tmk-group.com/services/cafe/msk/pokrovka" target="_blank">Камеры в кафе можно найти тут.</a>"
            buttons:
                "Назад" -> /Кафе Москва/начало
                "На главную" -> /Вот что я умею

        state: Акция на бесплатный кофе || sessionResult = "Акция бесплатный кофе", sessionResultColor = "#FFFFFF"
            intent!: /Кафе Москва/Акция на бесплатный кофе
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
            else: 
                go!: /У нас нет для вас информации
                    
            a: Акция на бесплатный кофе для сотрудников ТМК действует по понедельникам и пятницам с 08:30 до 09:00. || htmlEnabled = true, html = "Акция на <b>бесплатный </b>кофе для сотрудников ТМК действует по <b>понедельникам</b> и <b>пятницам</b> с 08:30 до 09:00."
            buttons:
                    "На главную" -> /Вот что я умею
                    "Назад"->/Кафе Москва

        state: начало
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
            else: 
                go!: /У нас нет для вас информации
                    
                
            a: Очень важно знать о работе кафе. Что вас интересует? || htmlEnabled = true, html = "Очень важно знать о работе кафе. Что вас интересует?"
            buttons:
                "Работа кафетерия" -> /Кафе Москва/Время работы кафетерия
                "Акция на бесплатный кофе " -> /Кафе Москва/Акция на бесплатный кофе
                "Камера в столовой" -> /Кафе Москва/Камера_в_столовой
                "Обратная связь по работе кафе" -> /Кафе Москва/Обратная связь по работе кафе
                "Калории" -> /Кафе Москва/Калории
                "Меню в кафе" -> /Кафе Москва/Меню в кафе
                "Назад" -> /Вот что я умею

    #Test
    state: ChatGPT || sessionResult = "Интеграция с ChatGPT", sessionResultColor = "#143AD1"
        intent!: /ChatGPT
        script:
            //$session.message_history = [];
        go!: /ChatGPT/Начало

        state: Mail_error_DataProcessingAgreement
            a: что-то пошло не так || htmlEnabled = true, html = "что-то пошло не так"
            script:
                $client.wasDataProcessingAgreement = false;
            buttons:
                "На главную" -> /Вот что я умею

        state: DataProcessingAgreement
            a: Используя ChatGPT вы соглашаетесь в том, что осознаете все риски и несете ответственность за передачу сведений, относящихся к информации ограниченного доступа или коммерческого характера.
                Ознакомиться с Концепцией информационной безопасности при использовании чат-бота можно по ссылке.
                
                 || htmlEnabled = true, html = "Используя ChatGPT вы соглашаетесь в том, что осознаете все риски и несете ответственность за передачу&nbsp;сведений, относящихся к информации ограниченного доступа или коммерческого характера.<br>Ознакомиться с Концепцией информационной безопасности при использовании чат-бота можно по&nbsp;<a href="https://min-jai.tmk-group.com/justai-botadmin/1000008/4523/Concept.docx " target="_blank">ссылке</a>.<br><br>"
            script:
                $session.wasDataProcessingAgreement = false;
            buttons:
                "Даю согласие" -> /ChatGPT/Agree
                "Не даю согласия" -> /ChatGPT/Disagree

        state: Agree
            script:
                $session.wasDataProcessingAgreement = true;
            go!: /ChatGPT/Mail_Agree
        
        state: Mail_Agree
            if: $session.startData
                script:
                    $session.ФИО = $session.startData.surname +" "+ $session.startData.name+ " " + $session.startData.patname;
                    $session.company = $session.startData.company;
                    $session.city = $session.startData.city;
            else: 
                script:
                    $session.ФИО = " No data";
                    $session.company = " No data";
                    $session.city = " No data";
            Email: 
                destination = digital@tmk-group.com
                subject = Согласие
                text = Ф.И.О. {{$session.ФИО}}       company: {{$session.company}}        city: {{$session.city}}
                files = []
                html = Ф.И.О. {{$session.ФИО}}<br>company: {{$session.company}}<br>city: {{$session.city}}<br><br>
                htmlEnabled = true
                okState = /ChatGPT/Начало
                errorState = /ChatGPT/Mail_error_DataProcessingAgreement

        state: Disagree
            script: $session.wasDataProcessingAgreement = false;
            go!: /Вот что я умею
            
        
        state: Send_question_email
            if: $session.startData
                script:
                    $session.ФИО = $session.startData.surname +" "+ $session.startData.name+ " " + $session.startData.patname;
                    $session.company = $session.startData.company;
                    $session.city = $session.startData.city;
            else: 
                script:
                    $session.ФИО = " No data";
                    $session.company = " No data";
                    $session.city = " No data";
            Email: 
                destination = digital@tmk-group.com
                subject = {{ $session.ФИО}}
                text = company: {{$session.company}} city: {{$session.city}} text: {{$session.question}} answer: {{$session.answer}} 
                files = []
                html = company: {{$session.company}}<br>city: {{$session.city}}<br>text: {{$session.question}} <br>answer: {{$session.answer}}&nbsp;
                htmlEnabled = true
                okState = /ChatGPT/Send_copy_email
                errorState = /ChatGPT/Send_question_email_error

        state: Send_copy_email
            Email: 
                destination = dozor@dozor.mos.tmk.group
                subject = {{ $session.ФИО}}
                text = company: {{$session.company}} city: {{$session.city}} text: {{$session.question}} answer: {{$session.answer}} 
                files = []
                html = company: {{$session.company}}<br>city: {{$session.city}}<br>text: {{$session.question}} <br>answer: {{$session.answer}}&nbsp;
                htmlEnabled = true
                okState = /ChatGPT/Продолжить диалог
                errorState = /ChatGPT/Send_question_email_error

        state: Send_question_email_error
            a: email error
            go!: /ChatGPT/Продолжить диалог

        state: Удалить историю
            script:
                $session.message_history = [];
            a: История поиска ChatGPT удалена! || htmlEnabled = true, html = "История поиска ChatGPT удалена."
            a: Будете продолжать диалог с ChatGPT? || htmlEnabled = true, html = "Будете продолжать диалог с ChatGPT?"
            buttons:
                "Далее" -> /ChatGPT/Вопрос
                "На главную" -> /Вот что я умею
            intent: /Далее || toState = "/ChatGPT/Вопрос"
            event: noMatch || toState = "/Нужно что-нибудь еще"

        state: Начало
            if: $session.startData
                if: (!$session.startData.name)
                    a: Услуга вам недоступна || htmlEnabled = true, html = "Услуга вам недоступна"
                    go!: /Вот что я умею
                else: 
                    script:
                        $session.ФИО = $session.startData.surname +" "+ $session.startData.name+ " " + $session.startData.patname;
                        $session.company = $session.startData.company;
                        $session.city = $session.startData.city;
            else: 
                a: Услуга вам недоступна
                go!: /Вот что я умею
            if: (!$session.wasDataProcessingAgreement)
                go!: /ChatGPT/DataProcessingAgreement
            else: 
                if: ($session.wasDataProcessingAgreement == false)
                    go!: /ChatGPT/DataProcessingAgreement
            a: Сервис в разработке!!!
                Используя ChatGPT вы соглашаетесь в том, что осознаете все риски и несете ответственность за передачу конфиденциальной информации. || htmlEnabled = true, html = "<b>Сервис в разработке!!!</b><br>Используя ChatGPT вы соглашаетесь в том, что осознаете все риски и несете ответственность за передачу конфиденциальной информации."
            if: $session.message_history
                go!: /ChatGPT/Вопрос
            else: 
                script:
                    $session.message_history = [];
            go!: /ChatGPT/Вопрос
            
        #a: На данный момент сценарий использования ChatGPT согласуется со службами безопасности. Для уменьшения рисков разглашения конфиденциальной информации.
        #go!: /Нужно что-нибудь еще
        state: Вопрос
            InputText: 
                prompt = Введите вопрос для ChatGPT
                varName = question
                html = 
                htmlEnabled = false
                actions = {}
                then = /ChatGPT/Ответ
                
        state: Ответ
            script:
                $session.answer = getAnswerGPT($session.question)
            #a: Ответ {{$session.answer.choices[0].message.content}}
            a: Ответ: {{$session.answer}}
            go!: /ChatGPT/Send_question_email

        state: Продолжить диалог
            a: Будете продолжать диалог с ChatGPT? || htmlEnabled = true, html = "Будете продолжать диалог с ChatGPT?"
            buttons:
                "Далее" -> /ChatGPT/Вопрос
                "На главную" -> /ChatGPT/Disagree
                "Удалить историю" -> /ChatGPT/Удалить историю
            intent: /Далее || toState = "/ChatGPT/Вопрос"
            intent: /Удалить историю || toState = "/ChatGPT/Удалить историю"
            event: noMatch || toState = "/Нужно что-нибудь еще"

    state: Кафе || sessionResult = "Кафе", sessionResultColor = "#7E47D1"
        intent!: /Кофе
        go!: /Кафе/Начало
        state: Начало
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city =="Москва"
                    go!: /Кафе Москва
                else:
                    go!: /У нас нет для вас информации
                
            else: 
               go!: /У нас нет для вас информации
                
       
        
        

    state: Заявка на самовыдвижение || sessionResult = "Заявка на самовыдвижение", sessionResultColor = "#15952F"
        intent!: /Заявка/заявка на самовыдвижение
        go!: /Заявка на самовыдвижение/Начало
        state: Начало
            a: Подать заявку на самовыдвижение в управленческий резерв Группы ТМК и ознакомиться с более подробной информацией Вы можете по ссылке || htmlEnabled = true, html = "Подать заявку на самовыдвижение в управленческий резерв Группы ТМК и ознакомиться с более подробной информацией Вы можете по <a href="https://portal.tmk-group.com/services/selfreserve/ " target="_blank">ссылке</a>"
            buttons:
                "На главную" -> /Вот что я умею
                "Снова" -> /Заявка на самовыдвижение

    state: Заказ корпоративного транспорта || sessionResult = "Заказ транспорта", sessionResultColor = "#7E47D1"
        intent!: /Заказ/Заказ корпоративного транспорта
        go!: /Заказ корпоративного транспорта/Начало

        state: Кто может заказать такси? || sessionResult = "Кто может заказать такси", sessionResultColor = "#FFFFFF"
            intent!: /Заказ/Заказ корпоративного транспорта/Кто может заказать такси?
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
               
            else: 
                go!: /У нас нет для вас информации
                
            a: Вы можете воспользоваться сервисом заказа такси, если Вы:
                - командируемый в Москве и Вам необходимо сопровождение в аэропорт и на ж/д вокзал;
                - руководитель подразделений ТМК/ТД и вам необходимо сопровождение
                на деловую встречу;
                - задержались на работе
                после 22.00 по распоряжению
                Руководства ТМК
                - в служебной командировке не можете воспользоваться городским транспортом, чтобы добраться до аэропорта и на ж/д вокзал.
                Заказать такси Вы можете на сервисе Helpdesk: HelpDesk (tmk-group.com)
                С более подробной информацией о сервисе Вы можете ознакомиться по ссылке || htmlEnabled = true, html = "Вы можете воспользоваться сервисом заказа такси, если Вы:<br>- командируемый в Москве и Вам необходимо сопровождение в аэропорт и на ж/д вокзал;<br>- руководитель подразделений ТМК/ТД и вам необходимо сопровождение <br>на деловую встречу;<br>- задержались на работе <br>после 22.00 по распоряжению <br>Руководства ТМК <br>- в служебной командировке не можете воспользоваться городским транспортом, чтобы добраться до аэропорта и на ж/д вокзал.  <br>Заказать такси Вы можете на сервисе <a href="https://helpdesk.tmk-group.com/0/Nui/ViewModule.aspx#SectionModuleV2/CaseSection" target="_blank">Helpdesk: HelpDesk (tmk-group.com)</a><br>С более подробной информацией о сервисе Вы можете ознакомиться по <a href="https://helpdesk.tmk-group.com/0/Nui/ViewModule.aspx#SectionModuleV2/CaseSection" target="_blank">ссылке</a><br>"
            buttons:
                "Когда я могу заказать такси?" -> /Заказ корпоративного транспорта/Когда я могу заказать такси?
                "Как заказать такси на выходные?" -> /Заказ корпоративного транспорта/Как заказать такси на выходные?
                "Заявка на такси не исполнена?" -> /Заказ корпоративного транспорта/Заявка на такси не исполнена?
                "На главную" -> /Вот что я умею

        state: Заявка на такси не исполнена? || sessionResult = "Исполнение заявки на такси", sessionResultColor = "#FFFFFF"
            intent!: /Заказ/Заказ корпоративного транспорта/Почему моя заявка на такси не исполнена?
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
               
            else: 
                go!: /У нас нет для вас информации
               
            a: Скорее всего, ваша заявка была подана с нарушением установленного срока.
                С более подробной информацией Вы можете ознакомиться по ссылке || htmlEnabled = true, html = "Скорее всего, ваша заявка была подана с нарушением установленного срока.<br><br>С более подробной информацией Вы можете ознакомиться по<a href="https://helpdesk.tmk-group.com/0/Nui/ViewModule.aspx#SectionModuleV2/CaseSection" target="_blank"> ссылке</a><br>"
            buttons:
                "Когда я могу заказать такси?" -> /Заказ корпоративного транспорта/Когда я могу заказать такси?
                "Как заказать такси на выходные?" -> /Заказ корпоративного транспорта/Как заказать такси на выходные?
                "Кто может заказать такси?" -> /Заказ корпоративного транспорта/Кто может заказать такси?
                "На главную" -> /Вот что я умею

        state: Когда я могу заказать такси? || sessionResult = "Время заказа такси", sessionResultColor = "#FFFFFF"
            intent!: /Заказ/Заказ корпоративного транспорта/Когда я могу заказать такси?
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
                
            else: 
                go!: /У нас нет для вас информации
            a: Подать заявку на такси можно не позднее, чем за двое суток до ее исполнения.\nЗаявки на выходные дни и на утро понедельника принимаются в пятницу, до 13:00 по московскому времени.\nЗаказать такси Вы можете на сервисе Helpdesk: HelpDesk (tmk-group.com)\nС более подробной информацией о сервисе Вы можете ознакомиться по ссылке || htmlEnabled = true, html = "Подать заявку на такси можно не позднее, чем за двое суток до ее исполнения.\nЗаявки на выходные дни и на утро понедельника принимаются в пятницу, до 13:00 по московскому времени.\nЗаказать такси Вы можете на сервисе Helpdesk: <a href="https://helpdesk.tmk-group.com/0/Nui/ViewModule.aspx#SectionModuleV2/ItePortalServiceCatalogSection" target="_blank">HelpDesk (tmk-group.com)</a>\nС более подробной информацией о сервисе Вы можете ознакомиться по<a href="https://helpdesk.tmk-group.com/0/Nui/ViewModule.aspx#SectionModuleV2/ItePortalServiceCatalogSection" target="_blank"> ссылке</a>"
            buttons:
                "Как заказать такси на выходные?" -> /Заказ корпоративного транспорта/Как заказать такси на выходные?
                "Заявка на такси не исполнена?" -> /Заказ корпоративного транспорта/Заявка на такси не исполнена?
                "Кто может заказать такси?" -> /Заказ корпоративного транспорта/Кто может заказать такси?
                "На главную" -> /Вот что я умею

        state: Как заказать такси на выходные? || sessionResult = "Как заказать такси в выходные", sessionResultColor = "#FFFFFF"
            intent!: /Заказ/Заказ корпоративного транспорта/Как заказать такси на выходные?
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
                
            else: 
                go!: /У нас нет для вас информации
                
            a: Заявки на выходные дни и на утро понедельника принимаются в пятницу, до 13:00 по московскому времени.
                Заказать такси Вы можете на сервисе Helpdesk: HelpDesk (tmk-group.com)
                С более подробной информацией о сервисе Вы можете ознакомиться по ссылке || htmlEnabled = true, html = "Заявки на выходные дни и на утро понедельника принимаются в пятницу, до 13:00 по московскому времени.<br><br>Заказать такси Вы можете на сервисе <a href="https://helpdesk.tmk-group.com/0/Nui/ViewModule.aspx#SectionModuleV2/CaseSection" target="_blank">Helpdesk: HelpDesk (tmk-group.com)</a><br><br>С более подробной информацией о сервисе Вы можете ознакомиться по<a href="https://helpdesk.tmk-group.com/0/Nui/ViewModule.aspx#SectionModuleV2/CaseSection" target="_blank"> ссылке</a><br>"
            buttons:
                "Когда я могу заказать такси?" -> /Заказ корпоративного транспорта/Когда я могу заказать такси?
                "Заявка на такси не исполнена?" -> /Заказ корпоративного транспорта/Заявка на такси не исполнена?
                "Кто может заказать такси?" -> /Заказ корпоративного транспорта/Кто может заказать такси?
                "На главную" -> /Вот что я умею
        state: Начало
            intent!: /Заказ/Заказ корпоративного транспорта/Транспорт
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city !="Москва"
                    go!: /У нас нет для вас информации
                
            else: 
                go!: /У нас нет для вас информации
                    
            image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4523/lODkvfiFPy5I8gkC.jpg
            a: Заказать такси Вы можете на сервисе Helpdesk: HelpDesk (tmk-group.com)
                С более подробной информацией о сервисе Вы можете ознакомиться по ссылке || htmlEnabled = true, html = "Заказать такси Вы можете на сервисе <a href="https://helpdesk.tmk-group.com/0/Nui/ViewModule.aspx#SectionModuleV2/CaseSection/" target="_blank">Helpdesk: HelpDesk (tmk-group.com)</a><br>С более подробной информацией о сервисе Вы можете ознакомиться по <i style=""><b></b></i><a href="https://helpdesk.tmk-group.com/0/Nui/ViewModule.aspx#SectionModuleV2/CaseSection/" target="_blank">ссылке</a><br>"
            buttons:
                "Когда я могу заказать такси?" -> /Заказ корпоративного транспорта/Когда я могу заказать такси?
                "Как заказать такси на выходные?" -> /Заказ корпоративного транспорта/Как заказать такси на выходные?
                "Заявка на такси не исполнена?" -> /Заказ корпоративного транспорта/Заявка на такси не исполнена?
                "Кто может заказать такси?" -> /Заказ корпоративного транспорта/Кто может заказать такси?
                "На главную" -> /Вот что я умею
    
       
       
    #Test        
    state: Корпоративный портал || sessionResult = "HD корпоративный портал", sessionResultColor = "#15952F"
        intent!: /Услуга/Корпоративный портал
        a: Корпоративный портал || htmlEnabled = true, html = "Корпоративный портал"
        go!: /Корпоративный портал/Провлема

        state: Подтверждение
            a: Обращение № 112212334 создано. С вами свяжется оператор. || htmlEnabled = true, html = "Обращение № 112212334 создано. С вами свяжется оператор."
            buttons:
                "На главную" -> /Вот что я умею
                "Снова" -> /Корпоративный портал

        state: Телефон
            InputPhoneNumber: 
                prompt = По какому номеру телефона можно с вами связаться (пример +7 911 111 11 11)?
                varName = phone_number
                html = 
                htmlEnabled = false
                failureMessage = ["Формат не правильный"]
                failureMessageHtml = ["Формат не правильный"]
                then = /Корпоративный портал/Срочное
                actions = {}

        state: Срочное_Нет
            script:
                $session.urgent= "Нет cрочное"
            go!: /Корпоративный портал/Подтверждение

        state: Срочное_Да
            script:
                $session.urgent= "Нет cрочное"
            go!: /Корпоративный портал/Подтверждение

        state: Срочное
            a: У вас срочное обращение?
                 || htmlEnabled = true, html = "У вас срочное обращение?<br>"
            buttons:
                "Да" -> /Корпоративный портал/Срочное_Да
                "Нет" -> /Корпоративный портал/Срочное_Нет
            intent: /Да || toState = "/Корпоративный портал/Срочное_Да"
            intent: /Нет || toState = "/Корпоративный портал/Срочное_Нет"
            event: noMatch || toState = "/Корпоративный портал/Срочное_Нет"

        state: Провлема
            InputText: 
                prompt = Сообщите детально какая у вас проблема?
                varName = problem
                html = 
                htmlEnabled = false
                then = /Корпоративный портал/Телефон
                actions = {}

    #Test
    state: Работа с данными 1С || sessionResult = "HD работа с 1С", sessionResultColor = "#15952F"
        intent!: /Услуга/Работа с данными 1С
        a: Работа с данными 1С || htmlEnabled = true, html = "Работа с данными 1С"
        go!: /Работа с данными 1С/Провлема

        state: IP адрес у компьютера
            InputText: 
                prompt = Какой IP адрес у компьютера (объяснить как получить)
                varName = IP_address
                html = 
                htmlEnabled = false
                then = /Работа с данными 1С/Подтверждение
                actions = {}

        state: Имя вашего компьютера
            InputText: 
                prompt = Сообщите имя вашего компьютера (объяснить как получить)
                varName = Имя_компьютера
                html = 
                htmlEnabled = false
                then = /Работа с данными 1С/IP адрес у компьютера
                actions = {}

        state: С какой БД у вас проблема
            InputText: 
                prompt = С какой БД у вас проблема?
                varName = С какой БД у вас проблема?
                html = with_which_database
                htmlEnabled = false
                then = /Работа с данными 1С/Имя вашего компьютера
                actions = {}

        state: Подтверждение
            a: Обращение № 112212334 создано. С вами свяжется оператор || htmlEnabled = true, html = "Обращение № 112212334 создано. С вами свяжется оператор"
            buttons:
                "На главную" -> /Вот что я умею
                "Снова" -> /Работа с данными 1С

        state: Телефон
            InputPhoneNumber: 
                prompt = По какому номеру телефона можно с вами связаться (пример +7 911 111 11 11)?
                varName = phone
                html = 
                htmlEnabled = false
                failureMessage = ["Формат не правильный"]
                failureMessageHtml = ["Формат не правильный"]
                then = /Работа с данными 1С/С какой БД у вас проблема
                actions = {}

        state: Срочное_Нет
            script:
                $session.urgent= "Нет cрочное"
            go!: /Работа с данными 1С/Телефон

        state: Срочное_Да
            script:
                $session.urgent= "Нет cрочное"
            go!: /Работа с данными 1С/Телефон

        state: Срочное
            a: У вас срочное обращение? || htmlEnabled = true, html = "У вас срочное обращение?"
            buttons:
                "Да" -> /Работа с данными 1С/Срочное_Да
                "Нет" -> /Работа с данными 1С/Срочное_Нет
            intent: /Да || toState = "/Работа с данными 1С/Срочное_Да"
            intent: /Нет || toState = "/Работа с данными 1С/Срочное_Нет"
            event: noMatch || toState = "/Работа с данными 1С/Срочное_Нет"

        state: Провлема
            InputText: 
                prompt = Сообщите детально какая у вас проблема?
                varName = problem
                html = 
                htmlEnabled = false
                then = /Работа с данными 1С/Срочное
                actions = {}

    #Test
    state: Профилактика и техническое обслуживание ПК || sessionResult = "HD профилактика и тех обслуживание", sessionResultColor = "#15952F"
        intent!: /Услуга/Профилактика и техническое обслуживание ПК
        a: Профилактика и техническое обслуживание ПК
        go!: /Профилактика и техническое обслуживание ПК/Провлема

        state: IP адрес у компьютера
            InputText: 
                prompt = Какой IP адрес у компьютера (объяснить как получить)
                varName = Какой IP адрес у компьютера (объяснить как получить)
                html = IP address
                htmlEnabled = false
                then = /Профилактика и техническое обслуживание ПК/Подтверждение
                actions = {}

        state: Имя вашего компьютера
            InputText: 
                prompt = Сообщите имя вашего компьютера
                varName = computer_name
                html = 
                htmlEnabled = false
                then = /Профилактика и техническое обслуживание ПК/IP адрес у компьютера
                actions = {}

        state: Место расположения
            InputText: 
                prompt = Сообщите ваше место расположения, включая корпус/этаж/номер кабинета
                varName = location
                html = 
                htmlEnabled = false
                then = /Профилактика и техническое обслуживание ПК/Имя вашего компьютера
                actions = {}

        state: Подтверждение
            a: Обращение № 112212334 создано. С вами свяжется оператор || htmlEnabled = true, html = "Обращение № 112212334 создано. С вами свяжется оператор"
            buttons:
                "На главную" -> /Вот что я умею
                "Снова" -> /Профилактика и техническое обслуживание ПК

        state: Телефон
            InputPhoneNumber: 
                prompt = По какому номеру телефона можно с вами связаться (пример +7 911 111 11 11)?
                varName = phone
                html = 
                htmlEnabled = false
                failureMessage = ["Формат не правильный"]
                failureMessageHtml = ["Формат не правильный"]
                then = /Профилактика и техническое обслуживание ПК/Место расположения
                actions = {}

        state: Срочное_Нет
            script:
                $session.urgent= "Нет cрочное"
            go!: /Профилактика и техническое обслуживание ПК/Телефон

        state: Срочное_Да
            script:
                $session.urgent= "Нет cрочное"
            go!: /Профилактика и техническое обслуживание ПК/Телефон

        state: Срочное
            a: У вас срочное обращение? || htmlEnabled = true, html = "У вас срочное обращение?"
            buttons:
                "Да" -> /Профилактика и техническое обслуживание ПК/Срочное_Да
                "Нет" -> /Профилактика и техническое обслуживание ПК/Срочное_Нет
            intent: /Да || toState = "/Профилактика и техническое обслуживание ПК/Срочное_Да"
            intent: /Нет || toState = "/Профилактика и техническое обслуживание ПК/Срочное_Нет"
            event: noMatch || toState = "/Профилактика и техническое обслуживание ПК/Срочное_Нет"

        state: Провлема
            InputText: 
                prompt = Сообщите детально какая у вас проблема?
                varName = problem
                html = 
                htmlEnabled = false
                then = /Профилактика и техническое обслуживание ПК/Срочное
                actions = {}

    #Test
    state: Консультация по работе с АРМ || sessionResult = "HD Консультация по работе с АРМ", sessionResultColor = "#15952F"
        intent!: /Услуга/Консультация по работе с АРМ
        a: Консультация по работе с АРМ
        go!: /Консультация по работе с АРМ/Провлема

        state: IP адрес у компьютера
            InputText: 
                prompt = Какой IP адрес у компьютера (объяснить как получить)
                varName = IP_address
                html = 
                htmlEnabled = false
                then = /Консультация по работе с АРМ/Подтверждение
                actions = {}

        state: Имя вашего компьютера
            InputText: 
                prompt = Сообщите имя вашего компьютера (объяснить как получить)
                varName = Имя_компьютера
                html = 
                htmlEnabled = false
                then = /Консультация по работе с АРМ/IP адрес у компьютера
                actions = {}

        state: Подтверждение
            a: Обращение № 112212334 создано. С вами свяжется оператор || htmlEnabled = true, html = "Обращение № 112212334 создано. С вами свяжется оператор"
            buttons:
                "На главную" -> /Вот что я умею
                "Снова" -> /Консультация по работе с АРМ

        state: Телефон
            InputPhoneNumber: 
                prompt = По какому номеру телефона можно с вами связаться (пример +7 911 111 11 11)?
                varName = phone
                html = 
                htmlEnabled = false
                failureMessage = ["Формат не правильный"]
                failureMessageHtml = ["Формат не правильный"]
                then = /Консультация по работе с АРМ/Имя вашего компьютера
                actions = {}

        state: Срочное_Нет
            script:
                $session.urgent= "Нет cрочное"
            go!: /Консультация по работе с АРМ/Телефон

        state: Срочное_Да
            script:
                $session.urgent= "Нет cрочное"
            go!: /Консультация по работе с АРМ/Телефон

        state: Срочное
            a: У вас срочное обращение? || htmlEnabled = true, html = "У вас срочное обращение?"
            buttons:
                "Да" -> /Консультация по работе с АРМ/Срочное_Да
                "Нет" -> /Консультация по работе с АРМ/Срочное_Нет
            intent: /Да || toState = "/Консультация по работе с АРМ/Срочное_Да"
            intent: /Нет || toState = "/Консультация по работе с АРМ/Срочное_Нет"
            event: noMatch || toState = "/Консультация по работе с АРМ/Срочное_Нет"

        state: Провлема
            InputText: 
                prompt = Сообщите детально какая у вас проблема?
                varName = problem
                html = 
                htmlEnabled = false
                then = /Консультация по работе с АРМ/Срочное
                actions = {}

    state: Информация о чат-боте || sessionResult = "Информация о боте", sessionResultColor = "#143AD1"
        intent!: /Информация о чат-боте
        go!: /Информация о чат-боте/Начало
        state: Начало
            a: Для начала работы с чат-ботом достаточно написать ему "Привет" и он предложит несколько тем, по которым можно получить информацию. || htmlEnabled = true, html = "Для начала работы с чат-ботом достаточно написать ему "Привет" и он предложит несколько тем, по которым можно получить информацию."
            a: Для общения с ботом можно переходить по кнопкам или писать текстовые запросы. Например, "Горячая линия". || htmlEnabled = true, html = "Для общения с ботом можно переходить по кнопкам или писать текстовые запросы. Например, "Горячая линия"."
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city =="Москва"
                    a: Чат-бот уже сейчас содержит информацию на темы:
                        Этика и закон.
                        Горячая линия.
                        Охрана труда.
                        Санаторно-курортный отдых и оздоровление.
                        Обучение.
                        Медицина.
                        Работа кафе в Москве.
                        Сервисы для сотрудников.
                        Полезная информация.
                        ТёМКА расширяет свой кругозор.
                        Сейчас в разработке сценарий по отправлению вопросов в ChatGPT и полезная информации о получении различных справок  || htmlEnabled = true, html = "<span style="letter-spacing: 0px;">Чат-бот уже сейчас содержит информацию на темы:</span><br><ul><li><span style="letter-spacing: 0px;">Этика и закон.</span></li><li><span style="letter-spacing: 0px;">Горячая линия.</span></li><li><span style="letter-spacing: 0px;">Охрана труда.</span></li><li><span style="letter-spacing: 0px;">Санаторно-курортный отдых и оздоровление.</span></li><li><span style="letter-spacing: 0px;">Обучение.</span></li><li><span style="letter-spacing: 0px;">Медицина.</span></li><li><span style="letter-spacing: 0px;">Работа кафе в Москве.</span></li><li><span style="letter-spacing: 0px;">Сервисы для сотрудников.</span><br></li><li><span style="letter-spacing: 0px;">Полезная информация.</span></li></ul>ТёМКА расширяет свой кругозор.<br>Сейчас в разработке сценарий по отправлению вопросов в ChatGPT и полезная информации о получении различных справок&nbsp;<br><br>"
                    image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/pw2JB0vN3WvcL2MT.jpg
                else: 
                    a: Чат-бот уже сейчас содержит информацию на темы:
                        Этика и закон.
                        Горячая линия.
                        Охрана труда.
                        Санаторно-курортный отдых и оздоровление.
                        Обучение.
                        Медицина.
                        Сервисы для сотрудников.
                        Полезная информация.
                        ТёМКА расширяет свой кругозор.
                        Сейчас в разработке сценарий по отправлению вопросов в ChatGPT и полезная информации о получении различных справок  || htmlEnabled = true, html = "<span style="letter-spacing: 0px;">Чат-бот уже сейчас содержит информацию на темы:</span><br><ul><li><span style="letter-spacing: 0px;">Этика и закон.</span></li><li><span style="letter-spacing: 0px;">Горячая линия.</span></li><li><span style="letter-spacing: 0px;">Охрана труда.</span></li><li><span style="letter-spacing: 0px;">Санаторно-курортный отдых и оздоровление.</span></li><li><span style="letter-spacing: 0px;">Обучение.</span></li><li><span style="letter-spacing: 0px;">Медицина.</span></li><li><span style="letter-spacing: 0px;">Сервисы для сотрудников.</span></li><li><span style="letter-spacing: 0px;">Полезная информация.</span></li></ul>ТёМКА расширяет свой кругозор.<br>Сейчас в разработке сценарий по отправлению вопросов в ChatGPT и полезная информации о получении различных справок&nbsp;<br><br>"
                    image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/aAnYitKgJutqJjgY.jpg
            else: 
                a: Чат-бот уже сейчас содержит информацию на темы:
                        Этика и закон.
                        Горячая линия.
                        Охрана труда.
                        Санаторно-курортный отдых и оздоровление.
                        Обучение.
                        Медицина.
                        Сервисы для сотрудников.
                        Полезная информация.
                        ТёМКА расширяет свой кругозор.
                        Сейчас в разработке сценарий по отправлению вопросов в ChatGPT и полезная информации о получении различных справок  || htmlEnabled = true, html = "<span style="letter-spacing: 0px;">Чат-бот уже сейчас содержит информацию на темы:</span><br><ul><li><span style="letter-spacing: 0px;">Этика и закон.</span></li><li><span style="letter-spacing: 0px;">Горячая линия.</span></li><li><span style="letter-spacing: 0px;">Охрана труда.</span></li><li><span style="letter-spacing: 0px;">Санаторно-курортный отдых и оздоровление.</span></li><li><span style="letter-spacing: 0px;">Обучение.</span></li><li><span style="letter-spacing: 0px;">Медицина.</span></li><li><span style="letter-spacing: 0px;">Сервисы для сотрудников.</span></li><li><span style="letter-spacing: 0px;">Полезная информация.</span></li></ul>ТёМКА расширяет свой кругозор.<br>Сейчас в разработке сценарий по отправлению вопросов в ChatGPT и полезная информации о получении различных справок&nbsp;<br><br>"
                image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/aAnYitKgJutqJjgY.jpg
            a: Предлагайте свои идеи через кнопку «Обратная связь». || htmlEnabled = true, html = "Предлагайте свои идеи через кнопку «Обратная связь»."
            buttons:
                "На главную" -> /Вот что я умею
            
            
    state: Расчетных листов || sessionResult = "Расчетный лист", sessionResultColor = "#15952F"
        intent!: /Расчетных листов
        go!: /Расчетных листов/Начало

        state: Text_3
            a: На текущий момент расчетные листы Вы можете получить привычным способом. || htmlEnabled = true, html = "На текущий момент расчетные листы Вы можете получить привычным способом."
            buttons:
                "На главную" -> /Вот что я умею
            
        state: Text_2
            a: Расчетные листы доступны Вам в электронной HR платформе SOTA2U в разделе «Расчетные листы». || htmlEnabled = true, html = "Расчетные листы доступны Вам в электронной HR платформе SOTA2U в разделе «<a href="https://sota2u.tmk-group.com/mira/#&amp;s=G0wtGxsbzHVpvhCWzTEM&amp;stype=nps&amp;inlineFrame=false&amp;name=%D0%A0%D0%B0%D1%81%D1%87%D0%B5%D1%82%D0%BD%D1%8B%D0%B5+%D0%BB%D0%B8%D1%81%D1%82%D1%8B&amp;doaction=Go&amp;id=0&amp;type=tmkviewpayslips" target="_blank">Расчетные листы</a>». "
            buttons:
                "На главную" -> /Вот что я умею

        state: Text_1
            a: На текущий момент расчетные листы Вы можете получить привычным способом. Корпоративный университет TMK2U сейчас работает над новым сервисом – скоро Вы сможете просматривать свои расчетные листы в электронной HR платформе SOTA2U. 
                Следите за новостями! || htmlEnabled = true, html = "На текущий момент расчетные листы Вы можете получить привычным способом. Корпоративный университет TMK2U сейчас работает над новым сервисом – скоро Вы сможете просматривать свои расчетные листы в электронной HR платформе SOTA2U.&nbsp;<br>Следите за новостями!"
            buttons:
                "На главную" -> /Вот что я умею

        state: Начало
            script:
                $session.grup_Расчетных = Расчетных_листов();
            if: ($session.grup_Расчетных == 1)
                go!: /Расчетных листов/Text_1
            if: ($session.grup_Расчетных == 2)
                go!: /Расчетных листов/Text_2
            go!: /Расчетных листов/Text_3
   

    state: Мы работаем
        a: На данный момент эта информация недоступна! || htmlEnabled = true, html = "На данный момент эта информация недоступна!"
        go!: /Вот что я умею

    #Test
    state: 2-НДФЛ || sessionResult = "2-НДФЛ", sessionResultColor = "#FFFFFF"
        intent!: /Заявка на 2-НДФЛ
        go!: /2-НДФЛ/Начало

        state: Период
            a: Период, за который требуется справка.
                формат ДД.ММ.ГГГГ
            go!: /2-НДФЛ/Период от

        state: text
            a: Заявка на 2-НДФЛ
                ФИО: {{$session.ФИО}}
                Период от {{$session.Период_от}}.
                Период до {{$session.Период_до}}.
                Куда предоставляется
                {{$session.Куда_предоставляется}}
                Контактный телефон {{$session.Контактный_телефон}}
                Комментарий
                {{$session.Комментарий}} || htmlEnabled = true, html = "Заявка на 2-НДФЛ<br>ФИО: {{$session.ФИО}}<br>Период от {{$session.Период_от}}.<br>Период до {{$session.Период_до}}.<br><br>Куда предоставляется<br>{{$session.Куда_предоставляется}}<br><br>Контактный телефон {{$session.Контактный_телефон}}<br><br>Комментарий<br>{{$session.Комментарий}}"
            a: Отправлять? || htmlEnabled = true, html = "<b>Отправлять?</b>"
            buttons:
                "Да" -> /2-НДФЛ/Send_Mail
                "Нет" -> /Вот что я умею
            intent: /Да || toState = "/2-НДФЛ/Send_Mail"
            intent: /Нет || toState = "/Вот что я умею"
            event: noMatch || toState = "/Вот что я умею"

        state: TextToDate_do
            script:
                $session.Период_до = textToDate($session.Период_до);
            if:($session.Период_до == false)
                a: неверный формат ДД.ММ.ГГГГ
                go!: /2-НДФЛ/Период до
            script:
                $session.Период_до = $session.Период_до.getDate() +"."+ ($session.Период_до.getMonth()) +"."+ $session.Период_до.getFullYear();
                    
            go!: /2-НДФЛ/Куда предоставляется

        state: TextToDate_ot
            script:
                $session.Период_от = textToDate($session.Период_от);
            if: ($session.Период_от == false)
                a: неверный формат ДД.ММ.ГГГГ
                go!: /2-НДФЛ/Период от
            script:
                $session.Период_от = $session.Период_от.getDate() +"."+ ($session.Период_от.getMonth()) +"."+ $session.Период_от.getFullYear();
            go!: /2-НДФЛ/Период до

        state: Успешный
            a: Запрос отправлен корректно. || htmlEnabled = true, html = "Запрос отправлен корректно."
            buttons:
                "На главную" -> /Вот что я умею
                "Cнова" -> /2-НДФЛ

        state: Error
            a: Произошла какая-то ошибка. 
                Запрос не был отправлен. 
                Попробуй в другой раз. || htmlEnabled = true, html = "Произошла какая-то ошибка.&nbsp;<br><b>Запрос не был отправлен.&nbsp;</b><br>Попробуй в другой раз."
            buttons:
                "На главную" -> /Вот что я умею
                "Назад" -> /2-НДФЛ

        state: Send_Mail
            Email: 
                destination = digital@tmk-group.com
                subject = Заявка на 2-НДФЛ
                text = Заявка на 2-НДФЛ
                    ФИО: {{$session.ФИО}}
                    Период от: {{$session.Период_от}}.
                    Период до: {{$session.Период_до}}.
                    
                    Куда предоставляется
                    {{$session.Куда_предоставляется}}
                    
                    Контактный телефон {{$session.Контактный_телефон}}
                    
                    Комментарий
                    {{$session.Комментарий}}
                    
                files = []
                html = <b>Заявка на 2-НДФЛ</b><br>ФИО: {{$session.ФИО}}<br>Период от: {{$session.Период_от}}.<br>Период до: {{$session.Период_до}}.<br><br><b>Куда предоставляется</b><br>{{$session.Куда_предоставляется}}<br><br>Контактный телефон {{$session.Контактный_телефон}}<br><br><b>Комментарий</b><br>{{$session.Комментарий}}<br>
                htmlEnabled = true
                okState = /2-НДФЛ/Успешный
                errorState = /2-НДФЛ/Error

        state: Комментарий
            InputText: 
                prompt = Комментарий
                varName = Комментарий
                html = 
                htmlEnabled = false
                then = /2-НДФЛ/text
                actions = {}

        state: Контактный телефон
            a: Роботающим в режиме удалённолого/смешанного графика роботы и цехах, просьба указывать номер номер мобилного телефона.
            InputPhoneNumber: 
                prompt = Контактный телефон
                varName = Контактный_телефон
                html = 
                htmlEnabled = false
                failureMessage = ["ошибка формата (+7 9111111111)"]
                failureMessageHtml = [""]
                actions = {}
                then = /2-НДФЛ/Комментарий

        state: Куда предоставляется
            InputText: 
                prompt = Куда предоставляется
                varName = Куда_предоставляется
                html = 
                htmlEnabled = false
                then = /2-НДФЛ/Контактный телефон
                actions = {}

        state: Период до
            InputText: 
                prompt = -До
                varName = Период_до
                html = 
                htmlEnabled = false
                then = /2-НДФЛ/TextToDate_do
                actions = {}

        state: Период от
            InputText: 
                prompt = От -
                varName = Период_от
                html = 
                htmlEnabled = false
                then = /2-НДФЛ/TextToDate_ot
                actions = {}

        state: Начало
            if: $session.startData
            #a: {{$session.startData.city}}
            else: 
                go!: /У нас нет для вас информации
            a: Обратить внимание! 
                Срок хранения в ЦБУ подготовленной для Вас справки 2-НДФЛ -1 месяц с даты подачи заявки. 
                По истечению срока справка аннулируется, если Вы не получили справку в указанный срок-необходимо будет подать новую заявку. || htmlEnabled = true, html = "<b>Обратить внимание!</b>&nbsp;<br>Срок хранения в ЦБУ подготовленной для Вас справки 2-НДФЛ -1 месяц с даты подачи заявки.&nbsp;<br>По истечению срока справка аннулируется, если Вы не получили справку в указанный срок-необходимо будет подать новую заявку."
            go!: /2-НДФЛ/Период

    state: Сказки GPT || sessionResult = "Сказки GPT", sessionResultColor = "#FFFFFF"
        intent: /Сказка
        go!: /Сказки GPT/Начало
        state: Начало
            a: В этом разделе я покажу примеры составления запросов в GPT модели. || htmlEnabled = true, html = "В этом разделе я покажу примеры составления запросов в GPT модели.<br>"
            a: Сегодня пример запроса в YandexGPT || htmlEnabled = true, html = "Сегодня пример запроса в YandexGPT<br>"
            a: Что подарить коллеге металлургу на Новый год?
                 || htmlEnabled = true, html = "<b>Что подарить коллеге металлургу на Новый год?</b><br>"
            a: Новогодний елочный шар с отливом металла и гравировкой «С Новым Годом, металлург!».
                Набор столовых приборов из нержавеющей стали с гравировкой «Для металлурга».
                Кружка из металла с новогодним рисунком и надписью «Лучшему металлургу».
                Настольный металлический календарь на следующий год с логотипом металлургической отрасли.
                Брелок для ключей в виде металлического слитка.
                Металлический держатель для визиток с гравировкой инициалов металлурга.
                Новогодняя металлическая фигурка доменной печи.
                Металлическая визитница с гравировкой имени коллеги.
                Набор металлических новогодних магнитов с символикой металлургической отрасли.
                Металлический блокнот для заметок с индивидуальным дизайном «С Новым годом, коллега-металлург!».  || htmlEnabled = true, html = "<ol><li>Новогодний елочный шар с отливом металла и гравировкой «С Новым Годом, металлург!».</li><li>Набор столовых приборов из нержавеющей стали с гравировкой «Для металлурга».</li><li>Кружка из металла с новогодним рисунком и надписью «Лучшему металлургу».</li><li>Настольный металлический календарь на следующий год с логотипом металлургической отрасли.</li><li>Брелок для ключей в виде металлического слитка.</li><li>Металлический держатель для визиток с гравировкой инициалов металлурга.</li><li>Новогодняя металлическая фигурка доменной печи.</li><li>Металлическая визитница с гравировкой имени коллеги.</li><li>Набор металлических новогодних магнитов с символикой металлургической отрасли.</li><li>Металлический блокнот для заметок с индивидуальным дизайном «С Новым годом, коллега-металлург!».&nbsp;</li></ol>"
            a: При выборе подарка учитывайте интересы и предпочтения коллеги, чтобы подарок был приятным и полезным. || htmlEnabled = true, html = "При выборе подарка учитывайте интересы и предпочтения коллеги, чтобы подарок был приятным и полезным."
            a: В обратной связи чат-бота, также можете указывать идеи для следующих запросов к GPT. || htmlEnabled = true, html = "В обратной связи чат-бота, также можете указывать идеи для следующих запросов к GPT."
            buttons:
                "На главную" -> /Вот что я умею
            #image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/4rayGwVzdtadraKQ.jpg
            
    
    #Test
    state: YandexGPT || sessionResult = "YandexGPT", sessionResultColor = "#143AD1"
        intent!: /YandexGPT
        go!: /YandexGPT/Начало
        
        state: DataProcessingAgreement
            a: Требования информационной безопасности.
                При использовании чат-бота работнику запрещается отправлять в него информацию коммерческого характера или информацию, составляющую коммерческую тайну . пользователь чат-бота должен соблюдать требования «Политики информационной безопасности российский предприятий Группы ТМК и «Положения по защите информации, составляющей коммерческую тайну Российских предприятий Группы ТМК».
                 || htmlEnabled = true, html = "<b>Требования информационной безопасности.</b><br>При использовании чат-бота работнику запрещается отправлять в него информацию коммерческого характера или информацию, составляющую коммерческую тайну . пользователь чат-бота должен соблюдать требования «Политики информационной безопасности российский предприятий Группы ТМК и «Положения по защите информации, составляющей коммерческую тайну Российских предприятий Группы ТМК».<br>"
            a: А также запрещается использование чат-бота в целях, не предусмотренных его назначению.
                Ответственность за невыполнение требований информационной безопасности
                Работник Предприятия за несоблюдение требований информационной безопасности несет дисциплинарную, административную, гражданско-правовую и иную ответственность, предусмотренную действующим законодательством Российской Федерации.  || htmlEnabled = true, html = "А также запрещается использование чат-бота в целях, не предусмотренных его назначению.<br><b>Ответственность за невыполнение</b> требований информационной безопасности<br>Работник Предприятия за несоблюдение требований информационной безопасности несет дисциплинарную, административную, гражданско-правовую и иную ответственность, предусмотренную действующим законодательством Российской Федерации.&nbsp;"
            script:
                $client.wasDataProcessingAgreement = false;
            buttons:
                "Даю согласие" -> /YandexGPT/Agree
                "Не даю согласия" -> /YandexGPT/Disagree

        state: Agree
            script: $client.wasDataProcessingAgreement = true;
            go!: /YandexGPT/Начало
            
        state: Disagree
            script: $client.wasDataProcessingAgreement = false;
            go!: /Вот что я умею

        state: Mail_Error
            a: Что-то пошло не так. || htmlEnabled = true, html = "Что-то пошло не так."
            buttons:
                "еще один вопрос" -> /YandexGPT/Question
                "Удалить историю" -> /YandexGPT/Начало
                "На главную" -> /Вот что я умею

        state: Mail_Ok
            a: {{$session.answer}} || htmlEnabled = false, html = "{{$session.answer}}"
            buttons:
                "еще один вопрос" -> /YandexGPT/Question
                "Удалить историю" -> /YandexGPT/Начало
                "На главную" -> /Вот что я умею
        
        state: Send_question_email
            if: $session.startData
                script:
                    $session.ФИО = $session.startData.surname +" "+ $session.startData.name+ " " + $session.startData.patname;
                        $session.company = $session.startData.company;
                        $session.city = $session.startData.city;
            else: 
                script:
                    $session.ФИО = " No data";
                        $session.company = " No data";
                        $session.city = " No data";
            Email: 
                destination = digital@tmk-group.com
                subject = {{ $session.ФИО}}
                text = company: {{$session.company}} city: {{$session.city}} text: {{$session.question}} answer: {{$session.answer}} 
                files = []
                html = company: {{$session.company}}<br>city: {{$session.city}}<br>text: {{$session.question}} <br>answer: {{$session.answer}}&nbsp;
                htmlEnabled = true
                okState = /YandexGPT/Mail_Ok
                errorState = /YandexGPT/Mail_Error

        state: Answer
            script:
                $session.answer = getAnswerYandexGPT($session.question);
            go!: /YandexGPT/Send_question_email

        state: Question
            InputText: 
                prompt = Напишите свой вопрос в ЯндексGPT
                varName = question
                html = 
                htmlEnabled = false
                then = /YandexGPT/Answer
                actions = {}

        state: Начало
            if:(!$client.wasDataProcessingAgreement)
                go!: /YandexGPT/DataProcessingAgreement
            else:
                if:($client.wasDataProcessingAgreement == false)
                    go!: /YandexGPT/DataProcessingAgreement
            script:
                $session.message_history=[];
            go!: /YandexGPT/Question

    state: Get_companies?
        intent!: /Get_companies?
        go!: /Get_companies?/Начало2

        state: Text
            if:($session.Companies_i < $session.Companies_length-1 )
                script:
                    var t =$session.list_Companies[$session.Companies_i];
                    $session.Companies_i+=1;
                    $session.Companies_Text = JSON.stringify(t);
                a:{{$session.Companies_Text}}
                go!: /Get_companies?/Text
                    
                
            a: end 
            script:
                $session.Companies_Text="";
                $session.list_Companies = []
                $session.Companies_i=0;
                $session.Companies_length =0;
                

        state: Начало
            a: Get_companies? || htmlEnabled = true, html = "Get_companies?"
            script:
                $session.Companies_Text="";
                $session.list_Companies = getCompanies();
                $session.Companies_i=0;
                $session.Companies_length = $session.list_Companies.length;
            a: length :{{$session.Companies_length}} ;  i = {{$session.Companies_i}};
            go!: /Get_companies?/Text
            
        
        state: Начало2
            a: Get_companies? || htmlEnabled = true, html = "Get_companies?"
            script:
                $session.Companies_Text="";
                $session.list_Companies = getCompanies();
                $session.Companies_i=0;
                $session.Companies_length = $session.list_Companies.length;
            a: length :{{$session.list_Companies}} 
            
        state: IAM_Token
            intent!: /IAM_Token
            
            a: {{IAM_Token()}}
            
                

    state: Биржа идей || sessionResult = "Биржа идей", sessionResultColor = "#FFFFFF"
        intent!: /Биржа идей
        go!: /Биржа идей/Начало
        state: Начало
            a: Отправить своё предложение по улучшению Вы можете на «Биржу идей» .
                Подробнее о работе сервиса можно узнать здесь.
                 || htmlEnabled = true, html = "Отправить своё предложение по улучшению Вы можете на «<a href="https://portal.tmk-group.com/services/innovation/" target="_blank">Биржу идей</a>» .<br>Подробнее о работе сервиса можно узнать <a href="https://portal.tmk-group.com/services/innovation/about.aspx" target="_blank">здесь</a>.<br>"
            buttons:
                "На главную" -> /Вот что я умею
    
    #Test        
    state: Курс валют || sessionResult = "Курс валют", sessionResultColor = "#FFFFFF"
        intent!: /Курс валют
        go!: /Курс валют/Начало
        state: Начало
            a: Актуальный курс валют Вы можете посмотреть по ссылке. || htmlEnabled = true, html = "Актуальный курс валют Вы можете посмотреть по <a href="https://portal.tmk-group.com/services/CurrencyExchange/" target="_blank">ссылке</a>."
            buttons:
                "На главную" -> /Вот что я умею
            
    #Test
    state: Поиск сотрудника || sessionResult = "Поиск сотрудника", sessionResultColor = "#FFFFFF"
        intent!: /Поиск сотрудника
        go!: /Поиск сотрудника/Начало
        state: Начало
            a: Найти нужного Вам сотрудника можно на вкладке «Сотрудники».  || htmlEnabled = true, html = "Найти нужного Вам сотрудника можно на вкладке «<a href="https://portal.tmk-group.com/users/" target="_blank">Сотрудники</a>».&nbsp;"
            buttons:
                "На главную" -> /Вот что я умею
            
    state: Заявка в службу эксплуатации || sessionResult = "Заявка в службу эксплуатации", sessionResultColor = "#FFFFFF"
        intent!: /Заявка в службу эксплуатации
        go!: /Заявка в службу эксплуатации/Начало
        state: Начало
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city =="Москва"
                    a: Подать заявку на обслуживание в Службу эксплуатации Административной дирекции ПАО "ТМК" Вы можете на странице сервиса.
                         || htmlEnabled = true, html = "Подать заявку на обслуживание в Службу эксплуатации Административной дирекции ПАО "ТМК" Вы можете на <a href="https://portal.tmk-group.com/services/mservice/" target="_blank">странице сервиса.</a><br>"
                    buttons:
                        "На главную" -> /Вот что я умею
                else:
                    a: Эта услуга вам недоступна
                    buttons:
                        "На главную" -> /Вот что я умею
            else:
                a: Эта услуга вам недоступна
                buttons:
                    "На главную" -> /Вот что я умею
     
    #Test       
    state: Дни рождения || sessionResult = "Дни рождения", sessionResultColor = "#FFFFFF"
        intent!: /Дни рождения
        go!: /Дни рождения/Начало
        state: Начало
            a: Узнать, кто сегодня отмечает день рождения и поздравить его, Вы можете на странице  «Дни рождения сотрудников». || htmlEnabled = true, html = "Узнать, кто сегодня отмечает день рождения и поздравить его, Вы можете на странице&nbsp;<a href="https://portal.tmk-group.com/services/birthdays/" target="_blank">«Дни рождения сотрудников»</a>."
            buttons:
                "На главную" -> /Вот что я умею
            
    
    #Test
    state: Заказ гостевого пропуска || sessionResult = "Заказ гостевого пропуска", sessionResultColor = "#8A7522"
        intent!: /Заказ гостевого пропуска
        go!: /Заказ гостевого пропуска/Начало

        state: Начало
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city =="Москва"
                    a: Воспользуйтесь современным сервисом оформления гостевых пропусков ССЫЛКА. Оформите заявку с указанием СМС или E-mail посетителя. Гость после электронной регистрации получит разовый пропуск в виде штрих-кода. || htmlEnabled = true, html = "Воспользуйтесь современным сервисом оформления гостевых пропусков <a href="https://portal.tmk-group.com/services/onepass/tmk/" target="_blank">ССЫЛКА</a>. Оформите заявку с указанием СМС или E-mail посетителя. Гость после электронной регистрации получит разовый пропуск в виде штрих-кода."
                    a: Электронная регистрация займет не более 1 мин, посетителю необходимо указать реквизиты документа удостоверяющего личность и предъявить его сотруднику охранной организации после прохода турникета. || htmlEnabled = true, html = "Электронная регистрация займет не более 1 мин, посетителю необходимо указать реквизиты документа удостоверяющего личность и предъявить его сотруднику охранной организации после прохода турникета."
                    buttons:
                        "Кто может заказать гостевой пропуск?" -> /Заказ гостевого пропуска/Кто может заказать гостевой пропуск?
                        "Куда можно заказать гостевой пропуск?" -> /Заказ гостевого пропуска/Куда можно заказать гостевой пропуск?
                        "Почему у меня недоступен выбор способа получения пропуска "Ресепшн"?" -> /Заказ гостевого пропуска/Почему у меня недоступен выбор способа получения пропуска "Ресепшн"?
                        "Чем отличаются способы получения пропуска по СМС, e-mail или Ресепшн?" -> /Заказ гостевого пропуска/Чем отличаются способы получения пропуска по СМС, e-mail или Ресепшн?
                        "Как проверить статус оформленной заявки?" -> /Заказ гостевого пропуска/Как проверить статус оформленной заявки?
                        "Как подавать заявки без согласования?" -> /Заказ гостевого пропуска/Как подавать заявки без согласования?
                        "Кто может согласовать заявку при отстутсвии Руководителя?" -> /Заказ гостевого пропуска/Кто может согласовать заявку при отсутсвии Руководителя?
                        "Как подать заявку только на въезд автомобиля?" -> /Заказ гостевого пропуска/Как подать заявку только на въезд автомобиля?
                        "Остались вопросы?" -> /Заказ гостевого пропуска/Остались вопросы?
                        "На главную" -> /Вот что я умею
                else: 
                    a: Эта услуга вам недоступна
                    go!: /Вот что я умею
            else: 
                a: Эта услуга вам недоступна
                go!: /Вот что я умею

        state: Кто может заказать гостевой пропуск?
            a: Подать заявку на оформление гостевого пропуска может любой сотрудник ПАО "ТМК" (с локацией в г. Москва) за исключением сотрудников обособленных подразделений (ОП). || htmlEnabled = true, html = "Подать заявку на оформление гостевого пропуска может любой сотрудник ПАО "ТМК" (с локацией в г. Москва) за исключением сотрудников обособленных подразделений (ОП)."
            buttons:
                "Назад" -> /Заказ гостевого пропуска
                "На главную" -> /Вот что я умею

        state: Куда можно заказать гостевой пропуск?
            a: В настоящий момент сервис работает только для организации посещений головного офиса Компании (Покровка 40 стр.2а) || htmlEnabled = true, html = "В настоящий момент сервис работает только для организации посещений головного офиса Компании (Покровка 40 стр.2а)"
            buttons:
                "Назад" -> /Заказ гостевого пропуска
                "На главную" -> /Вот что я умею

        state: Почему у меня недоступен выбор способа получения пропуска "Ресепшн"?
            a: С целью обеспечения преимущественно электронной регистрации и исключения очередей, данный способ доступен для Руководителей и для сотрудников имеющих право подачи заявок без согласования. || htmlEnabled = true, html = "С целью обеспечения преимущественно электронной регистрации и исключения очередей, данный способ доступен для Руководителей и для сотрудников имеющих право подачи заявок без согласования."
            buttons:
                "Назад" -> /Заказ гостевого пропуска
                "На главную" -> /Вот что я умею

        state: Чем отличаются способы получения пропуска по СМС, e-mail или Ресепшн?
            a: При оформлении заявки с указанием мобильного телефона или e-mail, посетитель получит пропуск в виде штрих-кода без необходимости посещения стойки регистрации. При указании Ресепшн гость получит карту доступа на стойке регистрации. || htmlEnabled = true, html = "При оформлении заявки с указанием мобильного телефона или e-mail, посетитель получит пропуск в виде штрих-кода без необходимости посещения стойки регистрации. При указании Ресепшн гость получит карту доступа на стойке регистрации."
            buttons:
                "Назад" -> /Заказ гостевого пропуска
                "На главную" -> /Вот что я умею

        state: Как проверить статус оформленной заявки?
            a: Об измении статуса Вы будете уведомлены по электронной почте. Текущий статус заявки отображается в правой части экрана оформленной заявки. || htmlEnabled = true, html = "Об измении статуса Вы будете уведомлены по электронной почте. Текущий статус заявки отображается в правой части экрана оформленной заявки."
            buttons:
                "Назад" -> /Заказ гостевого пропуска
                "На главную" -> /Вот что я умею

        state: Как подавать заявки без согласования?
            a: Для оформления права подачи заявок без согласования Вам необходимо оформить мотивированное обращение по СЭДО на имя Начальника УЭБ СЭБ Ларина Сергея Николаевича. || htmlEnabled = true, html = "Для оформления права подачи заявок без согласования Вам необходимо оформить мотивированное обращение по СЭДО на имя Начальника УЭБ СЭБ Ларина Сергея Николаевича."
            buttons:
                "Назад" -> /Заказ гостевого пропуска
                "На главную" -> /Вот что я умею

        state: Кто может согласовать заявку при отсутсвии Руководителя?
            a: Право согласования любой оформленной заявки имеет начальник Отдела контроля режимов безопасности Воробьев Андрей Викторович, опишите ситуацию и перешлите ему ссылку для просмотра заявки. || htmlEnabled = true, html = "Право согласования любой оформленной заявки имеет начальник Отдела контроля режимов безопасности Воробьев Андрей Викторович, опишите ситуацию и перешлите ему ссылку для просмотра заявки."
            buttons:
                "Назад" -> /Заказ гостевого пропуска
                "На главную" -> /Вот что я умею

        state: Как подать заявку только на въезд автомобиля?
            a: Форма подачи заявки единая ССЫЛКА, выберите соответствующий чекбокс в блоке "Автотранспорт" и заполните данные по автомашине, блок информации "Посетитель" не заполняется. || htmlEnabled = true, html = "Форма подачи заявки единая <a href="https://portal.tmk-group.com/services/onepass/tmk/" target="_blank">ССЫЛКА</a>, выберите соответствующий чекбокс в блоке "Автотранспорт" и заполните данные по автомашине, блок информации "Посетитель" не заполняется."
            buttons:
                "Назад" -> /Заказ гостевого пропуска
                "На главную" -> /Вот что я умею

        state: Остались вопросы?
            a: За консультацией по работе сервиса Вы можете обратиться к Главному специалисту ОКРБ Лобанову Евгению Васильевичу тел. 128-16, к Ведущему специалисту по пропускному режиму ОКРБ Кирилловой Наталии Валерьевне по тел. 127-11. || htmlEnabled = true, html = "За консультацией по работе сервиса Вы можете обратиться к Главному специалисту ОКРБ Лобанову Евгению Васильевичу тел. 128-16, к Ведущему специалисту по пропускному режиму ОКРБ Кирилловой Наталии Валерьевне по тел. 127-11."
            buttons:
                "Назад" -> /Заказ гостевого пропуска
                "На главную" -> /Вот что я умею
    
    #Test    
    state: Электронные ключницы || sessionResult = "Электронные ключницы", sessionResultColor = "#8A7522"
        intent!: /Электронные ключницы
        go!: /Электронные ключницы/Начало

        state: Начало
            if: $session.startData
                #a: {{$session.startData.city}}
                if: $session.startData.city =="Москва"
                    a: Для повседневного получения ключей через электронные ключницы Вам необходимо оформить мотивированное обращение на имя начальника Отдела контроля режимов безопасности Воробьева Андрея Викторовича (по СЭДО или пришлите скан письма по электронной почте). || htmlEnabled = true, html = "Для повседневного получения ключей через электронные ключницы Вам необходимо оформить мотивированное обращение на имя начальника Отдела контроля режимов безопасности Воробьева Андрея Викторовича (по СЭДО или пришлите скан письма по электронной почте)."
                    buttons:
                        "Как получить ключ?" -> /Электронные ключницы/Как получить ключ?
                        "Как правильно сдать ключ?" -> /Электронные ключницы/Как правильно сдать ключ?
                        "На главную" -> /Вот что я умею
                else:
                    a: Эта услуга вам недоступна            
                    go!: /Вот что я умею
            else:
                a: Эта услуга вам недоступна            
                go!: /Вот что я умею    
                
         #Информация по заказу пропуска/Электронные ключницы
        
        state: Как получить ключ?
            a: Поднесите пропуск к считывателю ВЗЯТЬ, при помощи сенсорного экрана выберите из списка доступных необходимый ключ, нажмите ВЫДАТЬ. || htmlEnabled = true, html = "Поднесите пропуск к считывателю ВЗЯТЬ, при помощи сенсорного экрана выберите из списка доступных необходимый ключ, нажмите ВЫДАТЬ."
            buttons:
                "Назад" -> /Электронные ключницы
                "На главную" -> /Вот что я умею

        state: Как правильно сдать ключ?
            a: Поднесите пропуск к считывателю СДАТЬ, поместите ключ в любую свободную ячейку, дождитесь сообщения системы о взятии кабинета под охрану. || htmlEnabled = true, html = "Поднесите пропуск к считывателю СДАТЬ, поместите ключ в любую свободную ячейку, дождитесь сообщения системы о взятии кабинета под охрану."
            buttons:
                "Назад" -> /Электронные ключницы
                "На главную" -> /Вот что я умею

    state: Личный профиль на портале || sessionResult = "Личный профиль на портале", sessionResultColor = "#FFFFFF"
        intent: /Личный профиль на портале
        go!: /Личный профиль на портале/Начало
        state: Начало
            a: Ваша персональная информация: должность, подразделение, контактная информация, размещена в личном профиле. Часть полей заполняется автоматически при приеме на работу, но есть поля, которые вы можете самостоятельно поправить или заполнить в случае их отсутствия. || htmlEnabled = true, html = "Ваша персональная информация: должность, подразделение, контактная информация, размещена в личном профиле.  Часть полей заполняется автоматически при приеме на работу, но есть поля, которые вы можете самостоятельно поправить или заполнить в случае их отсутствия.<br>"
            a: Для того чтобы изменить свой профиль необходимо в правом верхнем углу открыть выпадающий список напротив своей фамилии || htmlEnabled = true, html = "Для того чтобы изменить свой профиль необходимо в правом верхнем углу открыть выпадающий список напротив своей фамилии"
            image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/u7Mkk8fXVGYDDlwz.jpg
            a: В появившемся списке необходимо выбрать пункт "Показать профиль". || htmlEnabled = true, html = "В появившемся списке необходимо выбрать пункт "Показать профиль"."
            image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/YDCgtbO5CkhpxoWs.jpg
            a: Далее, чтобы перейти в настройки необходимо под вашей фотографией нажать кнопку "Настройка профиля" || htmlEnabled = true, html = "Далее, чтобы перейти в настройки необходимо под вашей фотографией нажать кнопку "Настройка профиля""
            image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/4My9vRud6w4BAFjO.jpg
            a: Здесь можно изменить:
                Изменить или указать свой внутренний номер телефона.
                Указать сотовый номер для входа в информационные системы.
                Указать сотовый номер для коммуникаций внутри ТМК (с настройками видимости).
                Указать свое местонахождение. || htmlEnabled = true, html = "Здесь можно изменить:<br><ul><li> Изменить или указать свой внутренний номер телефона.</li><li>Указать сотовый номер для входа в информационные системы.</li><li>Указать сотовый номер для коммуникаций внутри ТМК (с настройками видимости).</li><li>Указать свое местонахождение.</li></ul>"
            buttons:
                "На главную" -> /Вот что я умею

    state: У нас нет для вас информации
        go!: /У нас нет для вас информации/Начало
        state: Начало
            a: У нас нет для вас информации
            buttons:
                "На главную" -> /Вот что я умею
            
    
    state: HelpDesk сценарий
        intent!: /HelpDesk сценарий
        go!: /HelpDesk сценарий/Главная страница
        
        state: Подать обращение
            a: Подать обращение
                Чтобы подать обращение нажмите на соответствующую кнопку, а затем выберите тип запрашиваемой услуги и заполните карточку регистрации обращения.
                 || htmlEnabled = true, html = "<b>Подать обращение</b><br>Чтобы подать обращение нажмите на соответствующую кнопку, а затем выберите тип запрашиваемой услуги и заполните карточку регистрации обращения. <br>"
            image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/kFLDxk3UMXaPCELu.jpg
            buttons:
                "Главная страница" -> /HelpDesk сценарий/Главная страница
                "Обращения" -> /HelpDesk сценарий/Обращения
                "Мои обращения" -> /HelpDesk сценарий/Мои обращения
                "На главную" -> /Вот что я умею

        state: Обращения
            a: Обращения нужны для решения различных вопросов, например при проблемах с компьютерной техникой, ИТ-сервисами, корпоративными сетями или программным обеспечением.
                 || htmlEnabled = true, html = "<b>Обращения </b>нужны для решения различных вопросов, например при проблемах с компьютерной техникой, ИТ-сервисами, корпоративными сетями или программным обеспечением. <br>"
            image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/DUU1ThgdI99dVlk5.jpg
            buttons:
                "Главная страница" -> /HelpDesk сценарий/Главная страница
                "Мои обращения" -> /HelpDesk сценарий/Мои обращения
                "Подать обращение" -> /HelpDesk сценарий/Подать обращение
                "На главную" -> /Вот что я умею

        state: Мои обращения
            a: Мои обращения
                В данном разделе вы можете узнать информацию о своих обращениях: номер, статус и оказываемая услуга.
                 || htmlEnabled = true, html = "<b>Мои обращения</b><br>В данном разделе вы можете узнать информацию о своих обращениях: номер, статус и оказываемая услуга.<br>"
            image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/1JDiQdlBdqmkBCfQ.jpg
            buttons:
                "Главная страница" -> /HelpDesk сценарий/Главная страница
                "Обращения" -> /HelpDesk сценарий/Обращения
                "Подать обращение" -> /HelpDesk сценарий/Подать обращение
                "На главную" -> /Вот что я умею

        state: Главная страница
            a: Главная страница
                На главную страницу вы можете перейти с помощью кнопки «Главная страница» в левом меню. Здесь вы можете просмотреть информацию о своих обращениях, задать вопрос в Базу знаний, а также узнать о согласованиях и заданиях.
                 || htmlEnabled = true, html = "<b>Главная страница</b><br>На главную страницу вы можете перейти с помощью кнопки «Главная страница» в левом меню. Здесь вы можете просмотреть информацию о своих обращениях, задать вопрос в Базу знаний, а также узнать о согласованиях и заданиях.<br>"
            image: https://min-jai.tmk-group.com/justai-botadmin/1000008/4564/2QlacgFckbIL0zO1.jpg
            buttons:
                "Обращения" -> /HelpDesk сценарий/Обращения
                "Мои обращения" -> /HelpDesk сценарий/Мои обращения
                "Подать обращение" -> /HelpDesk сценарий/Подать обращение
                "На главную" -> /Вот что я умею